phanidaa/MTSH/20251120a_MTSH_552_DLMS_FLEX0_DBG_FLEX3_Opti/20251120a_MTSH_552_DLMS_FLEX0_DBG_FLEX3_Opti/20251120a_MTSH_552_DLMS_FLEX0_DBG_FLEX3_Opti/apps/metering_demo/src/config/pic32cxmtc_db/driver/metrology/drv_metrology_regs.h
/* -------- METER_TYPE : (MET_CONTROL Offset: 0x0C) (R/W  32) Sensor type and service type settings register -------- */
#define METER_TYPE_SENSOR_TYPE_I_A_Pos             _UINT32_(0)                                 /* (METER_TYPE) Current Sensor Type on A Phase Position */
#define METER_TYPE_SENSOR_TYPE_I_A_Msk             (_UINT32_(0x3) << METER_TYPE_SENSOR_TYPE_I_A_Pos)    /* (METER_TYPE) Current Sensor Type on A Phase Mask */
#define METER_TYPE_SENSOR_TYPE_I_A(value)          (METER_TYPE_SENSOR_TYPE_I_A_Msk & (_UINT32_(value) << METER_TYPE_SENSOR_TYPE_I_A_Pos))
#define   METER_TYPE_SENSOR_TYPE_I_A_CT_Val          _UINT32_(0x0)                             /* (METER_TYPE) Current Transformer */
#define   METER_TYPE_SENSOR_TYPE_I_A_SHUNT_Val       _UINT32_(0x1)                             /* (METER_TYPE) Resistive Shunt */
#define   METER_TYPE_SENSOR_TYPE_I_A_CRC_Val         _UINT32_(0x2)                             /* (METER_TYPE) Rogowski Coil (CRC) current sensor */
#define   METER_TYPE_SENSOR_TYPE_I_A_VRD_Val         _UINT32_(0x3)                             /* (METER_TYPE) Resistive Divider (VRD) voltage sensor */
#define METER_TYPE_SENSOR_TYPE_V_A_Pos             _UINT32_(2)                                 /* (METER_TYPE) Voltage Sensor Type on A Phase Position */
#define METER_TYPE_SENSOR_TYPE_V_A_Msk             (_UINT32_(0x3) << METER_TYPE_SENSOR_TYPE_V_A_Pos)    /* (METER_TYPE) Voltage Sensor Type on A Phase Mask */
#define METER_TYPE_SENSOR_TYPE_V_A(value)          (METER_TYPE_SENSOR_TYPE_V_A_Msk & (_UINT32_(value) << METER_TYPE_SENSOR_TYPE_V_A_Pos))
#define   METER_TYPE_SENSOR_TYPE_V_A_CT_Val          _UINT32_(0x0)                             /* (METER_TYPE) Current Transformer */
#define   METER_TYPE_SENSOR_TYPE_V_A_SHUNT_Val       _UINT32_(0x1)                             /* (METER_TYPE) Resistive Shunt */
#define   METER_TYPE_SENSOR_TYPE_V_A_CRC_Val         _UINT32_(0x2)                             /* (METER_TYPE) Rogowski Coil (CRC) current sensor */
#define   METER_TYPE_SENSOR_TYPE_V_A_VRD_Val         _UINT32_(0x3)                             /* (METER_TYPE) Resistive Divider (VRD) voltage sensor */
#define METER_TYPE_SENSOR_TYPE_I_B_Pos             _UINT32_(4)                                 /* (METER_TYPE) Current Sensor Type on A Phase Position */
#define METER_TYPE_SENSOR_TYPE_I_B_Msk             (_UINT32_(0x3) << METER_TYPE_SENSOR_TYPE_I_B_Pos)    /* (METER_TYPE) Current Sensor Type on A Phase Mask */
#define METER_TYPE_SENSOR_TYPE_I_B(value)          (METER_TYPE_SENSOR_TYPE_I_B_Msk & (_UINT32_(value) << METER_TYPE_SENSOR_TYPE_I_B_Pos))
#define   METER_TYPE_SENSOR_TYPE_I_B_CT_Val          _UINT32_(0x0)                             /* (METER_TYPE) Current Transformer */
#define   METER_TYPE_SENSOR_TYPE_I_B_SHUNT_Val       _UINT32_(0x1)                             /* (METER_TYPE) Resistive Shunt */
#define   METER_TYPE_SENSOR_TYPE_I_B_CRC_Val         _UINT32_(0x2)                             /* (METER_TYPE) Rogowski Coil (CRC) current sensor */
#define   METER_TYPE_SENSOR_TYPE_I_B_VRD_Val         _UINT32_(0x3)                             /* (METER_TYPE) Resistive Divider (VRD) voltage sensor */
#define METER_TYPE_SENSOR_TYPE_V_B_Pos             _UINT32_(6)                                 /* (METER_TYPE) Voltage Sensor Type on A Phase Position */
#define METER_TYPE_SENSOR_TYPE_V_B_Msk             (_UINT32_(0x3) << METER_TYPE_SENSOR_TYPE_V_B_Pos)    /* (METER_TYPE) Voltage Sensor Type on A Phase Mask */
#define METER_TYPE_SENSOR_TYPE_V_B(value)          (METER_TYPE_SENSOR_TYPE_V_B_Msk & (_UINT32_(value) << METER_TYPE_SENSOR_TYPE_V_B_Pos))
#define   METER_TYPE_SENSOR_TYPE_V_B_CT_Val          _UINT32_(0x0)                             /* (METER_TYPE) Current Transformer */
#define   METER_TYPE_SENSOR_TYPE_V_B_SHUNT_Val       _UINT32_(0x1)                             /* (METER_TYPE) Resistive Shunt */
#define   METER_TYPE_SENSOR_TYPE_V_B_CRC_Val         _UINT32_(0x2)                             /* (METER_TYPE) Rogowski Coil (CRC) current sensor */
#define   METER_TYPE_SENSOR_TYPE_V_B_VRD_Val         _UINT32_(0x3)                             /* (METER_TYPE) Resistive Divider (VRD) voltage sensor */
#define METER_TYPE_SENSOR_TYPE_I_C_Pos             _UINT32_(8)                                 /* (METER_TYPE) Current Sensor Type on A Phase Position */
#define METER_TYPE_SENSOR_TYPE_I_C_Msk             (_UINT32_(0x3) << METER_TYPE_SENSOR_TYPE_I_C_Pos)    /* (METER_TYPE) Current Sensor Type on A Phase Mask */
#define METER_TYPE_SENSOR_TYPE_I_C(value)          (METER_TYPE_SENSOR_TYPE_I_C_Msk & (_UINT32_(value) << METER_TYPE_SENSOR_TYPE_I_C_Pos))
#define   METER_TYPE_SENSOR_TYPE_I_C_CT_Val          _UINT32_(0x0)                             /* (METER_TYPE) Current Transformer */
#define   METER_TYPE_SENSOR_TYPE_I_C_SHUNT_Val       _UINT32_(0x1)                             /* (METER_TYPE) Resistive Shunt */
#define   METER_TYPE_SENSOR_TYPE_I_C_CRC_Val         _UINT32_(0x2)                             /* (METER_TYPE) Rogowski Coil (CRC) current sensor */
#define   METER_TYPE_SENSOR_TYPE_I_C_VRD_Val         _UINT32_(0x3)                             /* (METER_TYPE) Resistive Divider (VRD) voltage sensor */
#define METER_TYPE_SENSOR_TYPE_V_C_Pos             _UINT32_(10)                                 /* (METER_TYPE) Voltage Sensor Type on A Phase Position */
#define METER_TYPE_SENSOR_TYPE_V_C_Msk             (_UINT32_(0x3) << METER_TYPE_SENSOR_TYPE_V_C_Pos)    /* (METER_TYPE) Voltage Sensor Type on A Phase Mask */
#define METER_TYPE_SENSOR_TYPE_V_C(value)          (METER_TYPE_SENSOR_TYPE_V_C_Msk & (_UINT32_(value) << METER_TYPE_SENSOR_TYPE_V_C_Pos))
#define   METER_TYPE_SENSOR_TYPE_V_C_CT_Val          _UINT32_(0x0)                             /* (METER_TYPE) Current Transformer */
#define   METER_TYPE_SENSOR_TYPE_V_C_SHUNT_Val       _UINT32_(0x1)                             /* (METER_TYPE) Resistive Shunt */
#define   METER_TYPE_SENSOR_TYPE_V_C_CRC_Val         _UINT32_(0x2)                             /* (METER_TYPE) Rogowski Coil (CRC) current sensor */
#define   METER_TYPE_SENSOR_TYPE_V_C_VRD_Val         _UINT32_(0x3)                             /* (METER_TYPE) Resistive Divider (VRD) voltage sensor */
#define METER_TYPE_SERVICE_TYPE_Pos                _UINT32_(24)                                 /* (METER_TYPE) Electrical Service Type Position */
#define METER_TYPE_SERVICE_TYPE_Msk                (_UINT32_(0xF) << METER_TYPE_SERVICE_TYPE_Pos)    /* (METER_TYPE) Electrical Service Type Mask */
#define METER_TYPE_SENSOR_TYPE(value)             (METER_TYPE_SERVICE_TYPE_Msk & (_UINT32_(value) << METER_TYPE_SERVICE_TYPE_Pos))
#define   METER_TYPE_SERVICE_TYPE_3P4WY_3E_3V3I_Val          _UINT32_(0x0)                      /* (METER_TYPE) Three-phase 4-wire Wye (3-element) */
#define   METER_TYPE_SERVICE_TYPE_3P4WD_3E_3V3I_Val          _UINT32_(0x1)                      /* (METER_TYPE) Three-phase 4-wire Delta (3-element) */
#define   METER_TYPE_SERVICE_TYPE_3P3P4WY_2p5E_2V3I_Val      _UINT32_(0x2)                      /* (METER_TYPE) Three-phase 4-wire Wye (2-½ element) */
#define   METER_TYPE_SERVICE_TYPE_3P4WD_2E_3V2I_Val          _UINT32_(0x3)                      /* (METER_TYPE) Three-phase 4-wire Delta (2-element) */
#define   METER_TYPE_SERVICE_TYPE_3P3WD_2E_2V2I_Val          _UINT32_(0x4)                      /* (METER_TYPE) Three-phase 3-wire) Delta (2-element) */
#define   METER_TYPE_SERVICE_TYPE_2P3W_2E_2V2I_Val           _UINT32_(0x5)                      /* (METER_TYPE) Two-phase 3-wire Network (2 element) */
#define   METER_TYPE_SERVICE_TYPE_1P3W_1p5E_1V2I_Val         _UINT32_(0x6)                      /* (METER_TYPE) Single-phase 3-wire (1-½ element) */
#define   METER_TYPE_SERVICE_TYPE_1P2W_1E_1V1I_Val           _UINT32_(0x7)                      /* (METER_TYPE) Single-phase 2-wire (1 element) */
#define   METER_TYPE_SERVICE_TYPE_1P3W_1E_2V1I_Val           _UINT32_(0x8)                      /* (METER_TYPE) Single-phase 3-wire (1 element) */
#define   METER_TYPE_SERVICE_TYPE_1P2W_1E_1V2I_I0_Val        _UINT32_(0x9)                      /* (METER_TYPE) I0 Single-phase 2-wire using I0 (1 element) */
#define   METER_TYPE_SERVICE_TYPE_2P3W_2E_2V2I_I0_Val        _UINT32_(0xA)                      /* (METER_TYPE) I0 Two-phase 3-wire Network using I0 (2 element) */
#define METER_TYPE_MISSING_PHASE_Pos               _UINT32_(28)                                 /* (METER_TYPE) Missing phase voltage select Position */
#define METER_TYPE_MISSING_PHASE_Msk               (_UINT32_(0x3) << METER_TYPE_MISSING_PHASE_Pos)    /* (METER_TYPE) Missing phase voltage select Mask */
#define METER_TYPE_MISSING_PHASE(value)            (METER_TYPE_MISSING_PHASE_Msk & (_UINT32_(value) << METER_TYPE_MISSING_PHASE_Pos))
#define   METER_TYPE_MISSING_PHASE_A_Val             _UINT32_(0x0)                             /* (METER_TYPE) Generate missing phase voltage for Phase_A */
#define   METER_TYPE_MISSING_PHASE_B_Val             _UINT32_(0x1)                             /* (METER_TYPE) Generate missing phase voltage for Phase_B */
#define   METER_TYPE_MISSING_PHASE_C_Val             _UINT32_(0x2)                             /* (METER_TYPE) Generate missing phase voltage for Phase_C */
#define METER_TYPE_Dto4WY_TRANSFORM_Pos            _UINT32_(31)                                 /* (METER_TYPE) Transformation to equivalent 4WY Position */
#define METER_TYPE_Dto4WY_TRANSFORM_Msk            (_UINT32_(0x1) << METER_TYPE_Dto4WY_TRANSFORM_Pos)    /* (METER_TYPE) Transformation to equivalent 4WY Mask */
#define METER_TYPE_Dto4WY_TRANSFORM(value)         (METER_TYPE_Dto4WY_TRANSFORM_Msk & (_UINT32_(value) << METER_TYPE_Dto4WY_TRANSFORM_Pos))
#define   METER_TYPE_Dto4WY_TRANSFORM_DISABLED_Val   _UINT32_(0x0)                             /* (METER_TYPE) Phase voltages remain in native service (no transformation) */
#define   METER_TYPE_Dto4WY_TRANSFORM_ENABLED_Val    _UINT32_(0x1)                             /* (METER_TYPE) Phase voltages transformed into an equivalent 4-wire Wye service */

/* -------- M : (MET_CONTROL Offset: 0x10) (R/W  32) Number of line cycles for integration period (uQ12.0) -------- */
#define M_Pos                                      _UINT32_(0)                                 /* (M) Number of cycles of the integration period Position */
#define M_Msk                                      (_UINT32_(0xFFF) << M_Pos)                  /* (M) Number of cycles of the integration period Mask */
#define M_Val(value)                               (M_Msk & (_UINT32_(value) << M_Pos))

/* -------- N_MAX : (MET_CONTROL Offset: 0x14) (R/W  32) Maximum number of samples in an integration period (uQ24.0) -------- */
#define N_MAX_Pos                                 _UINT32_(0)                                  /* (N_MAX) Maximum number of samples in an integration period Position */
#define N_MAX_Msk                                 (_UINT32_(0xFFF) << N_MAX_Pos)               /* (N_MAX) Maximum number of samples in an integration period Mask */
#define N_MAX_Val(value)                          (N_MAX_Msk & (_UINT32_(value) << N_MAX_Pos))

/* -------- PULSE0_CTRL : (MET_CONTROL Offset: 0x18) (R/W  32) Pulse 0 control: enable/disable, polarity, quantity type selection -------- */
#define PULSE0_CTRL_PC0_WIDTH_Pos                  _UINT32_(0)                                 /* (PULSE0_CTRL) Pulse Width  */
#define PULSE0_CTRL_PC0_WIDTH_Msk                  (_UINT32_(0xFFFF) << PULSE0_CTRL_PC0_WIDTH_Pos)      /* (PULSE0_CTRL) Pulse Width  */
#define PULSE0_CTRL_PC0_WIDTH(value)               (PULSE0_CTRL_PC0_WIDTH_Msk & (_UINT32_(value) << PULSE0_CTRL_PC0_WIDTH_Pos))
#define PULSE0_CTRL_PC0_TYPE_Pos                  _UINT32_(16)                                 /* (PULSE0_CTRL) Pulse Type Selection Position */
#define PULSE0_CTRL_PC0_TYPE_Msk                  (_UINT32_(0xF) << PULSE0_CTRL_PC0_TYPE_Pos)      /* (PULSE0_CTRL) Pulse Type Selection Mask */
#define PULSE0_CTRL_PC0_TYPE(value)               (PULSE0_CTRL_PC0_TYPE_Msk & (_UINT32_(value) << PULSE0_CTRL_PC0_TYPE_Pos))
#define   PULSE0_CTRL_PC0_TYPE_P_T_Val              _UINT32_(0x0)                             /* (PULSE0_CTRL) Watt-hours, total all phases, fundamental + harmonics */
#define   PULSE0_CTRL_PC0_TYPE_P_T_F_Val            _UINT32_(0x1)                             /* (PULSE0_CTRL) Watt-hours, total all phases, fundamental only */
#define   PULSE0_CTRL_PC0_TYPE_Q_T_Val              _UINT32_(0x2)                             /* (PULSE0_CTRL) Var-hours, total all phases, fundamental + harmonics */
#define   PULSE0_CTRL_PC0_TYPE_Q_T_F_Val            _UINT32_(0x3)                             /* (PULSE0_CTRL) Var-hours, total all phases, fundamental only */
#define   PULSE0_CTRL_PC0_TYPE_I_T_Val              _UINT32_(0x4)                             /* (PULSE0_CTRL) Amp-squared-hours, total all phases, fundamental + harmonics */
#define   PULSE0_CTRL_PC0_TYPE_I_T_F_Val            _UINT32_(0x5)                             /* (PULSE0_CTRL) Amp-squared-hours, total all phases, fundamental only */
#define   PULSE0_CTRL_PC0_TYPE_S_T_Val              _UINT32_(0x6)                             /* (PULSE0_CTRL) VA-hours, total all phases, fundamental + harmonics. It is computed by multiplying Irms by Vrms */
#define   PULSE0_CTRL_PC0_TYPE_S_T_F_Val            _UINT32_(0x7)                             /* (PULSE0_CTRL) VA-hours, total all phases, fundamental only. It is computed by multiplying Irms (fundamental) by Vrms (fundamental) */
#define   PULSE0_CTRL_PC0_TYPE_S2_T_Val             _UINT32_(0x8)                             /* (PULSE0_CTRL) VA-hours, total all phases. It is computed as the square root of (P2+Q2) */
#define PULSE0_CTRL_PC0_POLARITY_Pos               _UINT32_(24)                                 /* (PULSE0_CTRL) Pulse Polarity Position  */
#define PULSE0_CTRL_PC0_POLARITY_Msk               (_UINT32_(0x1) << PULSE0_CTRL_PC0_POLARITY_Pos)      /* (PULSE0_CTRL) Pulse Polarity Mask  */
#define PULSE0_CTRL_PC0_POLARITY(value)            (PULSE0_CTRL_PC0_POLARITY_Msk & (_UINT32_(value) << PULSE0_CTRL_PC0_POLARITY_Pos))
#define   PULSE0_CTRL_PC0_POLARITY_LOW_Val           _UINT32_(0x0)                             /* (PULSE0_CTRL) Output pulse is low with width set by K_WIDTH, followed by an inactive level of high */
#define   PULSE0_CTRL_PC0_POLARITY_HIGH_Val          _UINT32_(0x1)                             /* (PULSE0_CTRL) Output pulse is high with width set by K_WIDTH, followed by an inactive level of low */
#define PULSE0_CTRL_PC0_OVERRIDE_Pos               _UINT32_(25)                                 /* (PULSE0_CTRL) Pulse Override Control Position  */
#define PULSE0_CTRL_PC0_OVERRIDE_Msk               (_UINT32_(0x1) << PULSE0_CTRL_PC0_OVERRIDE_Pos)      /* (PULSE0_CTRL) Pulse Override Control Mask  */
#define PULSE0_CTRL_PC0_OVERRIDE(value)            (PULSE0_CTRL_PC0_OVERRIDE_Msk & (_UINT32_(value) << PULSE0_CTRL_PC0_OVERRIDE_Pos))
#define   PULSE0_CTRL_PC0_OVERRIDE_ENABLED_Val       _UINT32_(0x0)                             /* (PULSE0_CTRL) Pulse generation functions as normal */
#define   PULSE0_CTRL_PC0_OVERRIDE_DISABLED_Val      _UINT32_(0x1)                             /* (PULSE0_CTRL) Pulse generation is temporarily disabled */
#define PULSE0_CTRL_PC0_ACC_HOLD_Pos               _UINT32_(26)                                 /* (PULSE0_CTRL) Pulse Accumulation Hold Control Position  */
#define PULSE0_CTRL_PC0_ACC_HOLD_Msk               (_UINT32_(0x1) << PULSE0_CTRL_PC0_ACC_HOLD_Pos)      /* (PULSE0_CTRL) Pulse Accumulation Hold Control Mask  */
#define PULSE0_CTRL_PC0_ACC_HOLD(value)            (PULSE0_CTRL_PC0_ACC_HOLD_Msk & (_UINT32_(value) << PULSE0_CTRL_PC0_ACC_HOLD_Pos))
#define   PULSE0_CTRL_PC0_ACC_HOLD_DISABLED_Val      _UINT32_(0x0)                             /* (PULSE0_CTRL) Pulse accumulation registers continue to increment even if pulse generation is temporarily disabled */
#define   PULSE0_CTRL_PC0_ACC_HOLD_ENABLED_Val       _UINT32_(0x1)                             /* (PULSE0_CTRL) Pulse accumulation is held static */
#define PULSE0_CTRL_OPD_ENABLE_Pos                 _UINT32_(27)                                /* (PULSE0_CTRL) Open Drain Enable Position  */
#define PULSE0_CTRL_OPD_ENABLE_Msk                 (_UINT32_(0x1) << PULSE0_CTRL_OPD_ENABLE_Pos)   /* (PULSE0_CTRL) Open Drain Enable Mask  */
#define PULSE0_CTRL_OPD_ENABLE(value)              (PULSE0_CTRL_OPD_ENABLE_Msk & (_UINT32_(value) << PULSE0_CTRL_OPD_ENABLE_Pos))
#define   PULSE0_CTRL_OPD_ENABLE_DISABLED_Val        _UINT32_(0x0)                             /* (PULSE0_CTRL) The open drain is disabled */
#define   PULSE0_CTRL_OPD_ENABLE_ENABLED_Val         _UINT32_(0x1)                             /* (PULSE0_CTRL) The open drain is enabled */
#define PULSE0_CTRL_PC0_DETENT_Pos                 _UINT32_(28)                                /* (PULSE0_CTRL) Total Absolute Values for P and Q values Position  */
#define PULSE0_CTRL_PC0_DETENT_Msk                 (_UINT32_(0x3) << PULSE0_CTRL_PC0_DETENT_Pos)   /* (PULSE0_CTRL) Total Absolute Values for P and Q values Mask  */
#define PULSE0_CTRL_PC0_DETENT(value)              (PULSE0_CTRL_PC0_DETENT_Msk & (_UINT32_(value) << PULSE0_CTRL_PC0_DETENT_Pos))
#define   PULSE0_CTRL_PC0_DETENT_NET_Val             _UINT32_(0x0)                             /* (PULSE0_CTRL) Pulses generated based on (energy delivered ? energy generated) */
#define   PULSE0_CTRL_PC0_DETENT_ABSOLUTE_Val        _UINT32_(0x1)                             /* (PULSE0_CTRL) Pulses generated based on (energy delivered + energy generated) */
#define   PULSE0_CTRL_PC0_DETENT_DELIVERED_Val       _UINT32_(0x2)                             /* (PULSE0_CTRL) Pulses generated based on (energy delivered only) */
#define   PULSE0_CTRL_PC0_DETENT_GENERATED_Val       _UINT32_(0x3)                             /* (PULSE0_CTRL) Pulses generated based on (energy generated only) */
#define PULSE0_CTRL_PU_ENABLE_Pos                  _UINT32_(30)                                /* (PULSE0_CTRL) Pull-Up Enable Position  */
#define PULSE0_CTRL_PU_ENABLE_Msk                  (_UINT32_(0x1) << PULSE0_CTRL_PU_ENABLE_Pos)   /* (PULSE0_CTRL) Pull-Up Enable Mask  */
#define PULSE0_CTRL_PU_ENABLE(value)               (PULSE0_CTRL_PU_ENABLE_Msk & (_UINT32_(value) << PULSE0_CTRL_PU_ENABLE_Pos))
#define   PULSE0_CTRL_PU_ENABLE_DISABLED_Val         _UINT32_(0x0)                             /* (PULSE0_CTRL) Pull-Up disabled */
#define   PULSE0_CTRL_PU_ENABLE_ENABLED_Val          _UINT32_(0x1)                             /* (PULSE0_CTRL) Pull-Up enabled */
#define PULSE0_CTRL_PC0_ENABLE_Pos                 _UINT32_(31)                                /* (PULSE0_CTRL) Output Pulse Enable Position  */
#define PULSE0_CTRL_PC0_ENABLE_Msk                 (_UINT32_(0x1) << PULSE0_CTRL_PC0_ENABLE_Pos)   /* (PULSE0_CTRL) Output Pulse Enable Mask  */
#define PULSE0_CTRL_PC0_ENABLE(value)              (PULSE0_CTRL_PC0_ENABLE_Msk & (_UINT32_(value) << PULSE0_CTRL_PC0_ENABLE_Pos))
#define   PULSE0_CTRL_PC0_ENABLE_DISABLED_Val        _UINT32_(0x0)                             /* (PULSE0_CTRL) Pulse output disabled, inactive level determined by PULSE_POLARITY */
#define   PULSE0_CTRL_PC0_ENABLE_ENABLED_Val         _UINT32_(0x1)                             /* (PULSE0_CTRL) Pulse output enabled */

