phanidaa/MTSH/20251120a_MTSH_552_DLMS_FLEX0_DBG_FLEX3_Opti/20251120a_MTSH_552_DLMS_FLEX0_DBG_FLEX3_Opti/20251120a_MTSH_552_DLMS_FLEX0_DBG_FLEX3_Opti/apps/metering_demo/src/config/pic32cxmtc_db/driver/metrology/drv_metrology_regs.h
/* -------- Q_K_t : (MET_CONTROL Offset: 0x28) (R/W  32) Meter Reactive Power Pulse Constant (uQ8.24) -------- */
#define Q_K_t_Pos                                  _UINT32_(0)                                 /* (Q_K_t) Meter Reactive Power Pulse Constantt Position */
#define Q_K_t_Msk                                  (_UINT32_(0xFFFFFFFF) << Q_K_t_Pos)         /* (Q_K_t) Meter Reactive Power Pulse Constant Mask */
#define Q_K_t_Val(value)                           (Q_K_t_Msk & (_UINT32_(value) << Q_K_t_Pos))

/* -------- I_K_t : (MET_CONTROL Offset: 0x2C) (R/W  32) Meter Current Pulse Constant (uQ8.24) -------- */
#define I_K_t_Pos                                  _UINT32_(0)                                 /* (I_K_t) Meter Current Pulse Constant Position */
#define I_K_t_Msk                                  (_UINT32_(0xFFFFFFFF) << I_K_t_Pos)         /* (I_K_t) Meter Current Pulse Constant Mask */
#define I_K_t_Val(value)                           (I_K_t_Msk & (_UINT32_(value) << I_K_t_Pos))

/* -------- S_K_t : (MET_CONTROL Offset: 0x30) (R/W  32) Meter Apparent Power Pulse Constant (uQ8.24) -------- */
#define S_K_t_Pos                                  _UINT32_(0)                                 /* (S_K_t) Meter Apparent Power Pulse Constant Position */
#define S_K_t_Msk                                  (_UINT32_(0xFFFFFFFF) << S_K_t_Pos)         /* (S_K_t) Meter Apparent Power Pulse Constant Mask */
#define S_K_t_Val(value)                           (S_K_t_Msk & (_UINT32_(value) << S_K_t_Pos))

/* -------- CREEP_THRESHOLD_P : (MET_CONTROL Offset: 0x34) (R/W  32) Creep Threshold for Active Energy (uQ2.30) -------- */
#define CREEP_THRESHOLD_P_Pos                      _UINT32_(0)                                 /* (CREEP_THRESHOLD_P) Creep Threshold for Active Energy Position */
#define CREEP_THRESHOLD_P_Msk                      (_UINT32_(0xFFFFFFFF) << CREEP_THRESHOLD_P_Pos)         /* (CREEP_THRESHOLD_P) Creep Threshold for Active Energy Mask */
#define CREEP_THRESHOLD_P_Val(value)               (CREEP_THRESHOLD_P_Msk & (_UINT32_(value) << CREEP_THRESHOLD_P_Pos))

/* -------- CREEP_THRESHOLD_Q : (MET_CONTROL Offset: 0x38) (R/W  32) Creep Threshold for Quadenergy (uQ2.30) -------- */
#define CREEP_THRESHOLD_Q_Pos                      _UINT32_(0)                                 /* (CREEP_THRESHOLD_Q) Creep Threshold for Quadenergy Position */
#define CREEP_THRESHOLD_Q_Msk                      (_UINT32_(0xFFFFFFFF) << CREEP_THRESHOLD_Q_Pos)         /* (CREEP_THRESHOLD_Q) Creep Threshold for Quadenergy Mask */
#define CREEP_THRESHOLD_Q_Val(value)               (CREEP_THRESHOLD_Q_Msk & (_UINT32_(value) << CREEP_THRESHOLD_Q_Pos))

/* -------- CREEP_THRESHOLD_I : (MET_CONTROL Offset: 0x3C) (R/W  32) Creep Threshold of Phase Current (uQ2.30) -------- */
#define CREEP_THRESHOLD_I_Pos                      _UINT32_(0)                                 /* (CREEP_THRESHOLD_I) Creep Threshold of Phase Current Position */
#define CREEP_THRESHOLD_I_Msk                      (_UINT32_(0xFFFFFFFF) << CREEP_THRESHOLD_I_Pos)         /* (CREEP_THRESHOLD_I) Creep Threshold of Phase Current Mask */
#define CREEP_THRESHOLD_I_Val(value)               (CREEP_THRESHOLD_I_Msk & (_UINT32_(value) << CREEP_THRESHOLD_I_Pos))

/* -------- CREEP_THRESHOLD_S : (MET_CONTROL Offset: 0x40) (R/W  32) Creep Threshold for Apparent Energy (uQ2.30) -------- */
#define CREEP_THRESHOLD_S_Pos                      _UINT32_(0)                                 /* (CREEP_THRESHOLD_S) Creep Threshold for Apparent Energy Position */
#define CREEP_THRESHOLD_S_Msk                      (_UINT32_(0xFFFFFFFF) << CREEP_THRESHOLD_S_Pos)         /* (CREEP_THRESHOLD_S) Creep Threshold for Apparent Energy Mask */
#define CREEP_THRESHOLD_S_Val(value)               (CREEP_THRESHOLD_S_Msk & (_UINT32_(value) << CREEP_THRESHOLD_S_Pos))

/* -------- POWER_OFFSET_CTRL : (MET_CONTROL Offset: 0x44) (R/W  32) Power offset control -------- */
#define POWER_OFFSET_CTRL_Q_OFFSET_ACC_A_Pos       _UINT32_(16)                                 /* (POWER_OFFSET_CTRL) Reactive Power Offset for Accumulator Quantities Enable Position */
#define POWER_OFFSET_CTRL_Q_OFFSET_ACC_A_Msk       (_UINT32_(0x1) << POWER_OFFSET_CTRL_Q_OFFSET_ACC_A_Pos)         /* (POWER_OFFSET_CTRL) Reactive Power Offset for Accumulator Quantities Enable Mask */
#define POWER_OFFSET_CTRL_Q_OFFSET_ACC_A(value)    (POWER_OFFSET_CTRL_Q_OFFSET_ACC_A_Msk & (_UINT32_(value) << POWER_OFFSET_CTRL_Q_OFFSET_ACC_A_Pos))
#define   POWER_OFFSET_CTRL_Q_OFFSET_ACC_A_DISABLED_Val        _UINT32_(0x0)                   /* (POWER_OFFSET_CTRL) Reactive Power Offset disabled */
#define   POWER_OFFSET_CTRL_Q_OFFSET_ACC_A_ENABLED_Val         _UINT32_(0x1)                   /* (POWER_OFFSET_CTRL) Reactive Power Offset enabled */
#define POWER_OFFSET_CTRL_Q_OFFSET_ACC_B_Pos       _UINT32_(17)                                /* (POWER_OFFSET_CTRL) Reactive Power Offset for Accumulator Quantities Enable Position */
#define POWER_OFFSET_CTRL_Q_OFFSET_ACC_B_Msk       (_UINT32_(0x1) << POWER_OFFSET_CTRL_Q_OFFSET_ACC_B_Pos)         /* (POWER_OFFSET_CTRL) Reactive Power Offset for Accumulator Quantities Enable Mask */
#define POWER_OFFSET_CTRL_Q_OFFSET_ACC_B(value)    (POWER_OFFSET_CTRL_Q_OFFSET_ACC_B_Msk & (_UINT32_(value) << POWER_OFFSET_CTRL_Q_OFFSET_ACC_B_Pos))
#define   POWER_OFFSET_CTRL_Q_OFFSET_ACC_B_DISABLED_Val        _UINT32_(0x0)                   /* (POWER_OFFSET_CTRL) Reactive Power Offset disabled */
#define   POWER_OFFSET_CTRL_Q_OFFSET_ACC_B_ENABLED_Val         _UINT32_(0x1)                   /* (POWER_OFFSET_CTRL) Reactive Power Offset enabled */
#define POWER_OFFSET_CTRL_Q_OFFSET_ACC_C_Pos       _UINT32_(18)                                /* (POWER_OFFSET_CTRL) Reactive Power Offset for Accumulator Quantities Enable Position */
#define POWER_OFFSET_CTRL_Q_OFFSET_ACC_C_Msk       (_UINT32_(0x1) << POWER_OFFSET_CTRL_Q_OFFSET_ACC_C_Pos)         /* (POWER_OFFSET_CTRL) Reactive Power Offset for Accumulator Quantities Enable Mask */
#define POWER_OFFSET_CTRL_Q_OFFSET_ACC_C(value)    (POWER_OFFSET_CTRL_Q_OFFSET_ACC_C_Msk & (_UINT32_(value) << POWER_OFFSET_CTRL_Q_OFFSET_ACC_C_Pos))
#define   POWER_OFFSET_CTRL_Q_OFFSET_ACC_C_DISABLED_Val        _UINT32_(0x0)                   /* (POWER_OFFSET_CTRL) Reactive Power Offset disabled */
#define   POWER_OFFSET_CTRL_Q_OFFSET_ACC_C_ENABLED_Val         _UINT32_(0x1)                   /* (POWER_OFFSET_CTRL) Reactive Power Offset enabled */
#define POWER_OFFSET_CTRL_P_OFFSET_ACC_A_Pos       _UINT32_(20)                                /* (POWER_OFFSET_CTRL) Active Power Offset for Accumulator Quantities Enable Position */
#define POWER_OFFSET_CTRL_P_OFFSET_ACC_A_Msk       (_UINT32_(0x1) << POWER_OFFSET_CTRL_P_OFFSET_ACC_A_Pos)         /* (POWER_OFFSET_CTRL) Active Power Offset for Accumulator Quantities Enable Mask */
#define POWER_OFFSET_CTRL_P_OFFSET_ACC_A(value)    (POWER_OFFSET_CTRL_P_OFFSET_ACC_A_Msk & (_UINT32_(value) << POWER_OFFSET_CTRL_P_OFFSET_ACC_A_Pos))
#define   POWER_OFFSET_CTRL_P_OFFSET_ACC_A_DISABLED_Val        _UINT32_(0x0)                   /* (POWER_OFFSET_CTRL) Active Power Offset disabled */
#define   POWER_OFFSET_CTRL_P_OFFSET_ACC_A_ENABLED_Val         _UINT32_(0x1)                   /* (POWER_OFFSET_CTRL) Active Power Offset enabled */
#define POWER_OFFSET_CTRL_P_OFFSET_ACC_B_Pos       _UINT32_(21)                                /* (POWER_OFFSET_CTRL) Active Power Offset for Accumulator Quantities Enable Position */
#define POWER_OFFSET_CTRL_P_OFFSET_ACC_B_Msk       (_UINT32_(0x1) << POWER_OFFSET_CTRL_P_OFFSET_ACC_B_Pos)         /* (POWER_OFFSET_CTRL) Active Power Offset for Accumulator Quantities Enable Mask */
#define POWER_OFFSET_CTRL_P_OFFSET_ACC_B(value)    (POWER_OFFSET_CTRL_P_OFFSET_ACC_B_Msk & (_UINT32_(value) << POWER_OFFSET_CTRL_P_OFFSET_ACC_B_Pos))
#define   POWER_OFFSET_CTRL_P_OFFSET_ACC_B_DISABLED_Val        _UINT32_(0x0)                   /* (POWER_OFFSET_CTRL) Active Power Offset disabled */
#define   POWER_OFFSET_CTRL_P_OFFSET_ACC_B_ENABLED_Val         _UINT32_(0x1)                   /* (POWER_OFFSET_CTRL) Active Power Offset enabled */
#define POWER_OFFSET_CTRL_P_OFFSET_ACC_C_Pos       _UINT32_(22)                                /* (POWER_OFFSET_CTRL) Active Power Offset for Accumulator Quantities Enable Position */
#define POWER_OFFSET_CTRL_P_OFFSET_ACC_C_Msk       (_UINT32_(0x1) << POWER_OFFSET_CTRL_P_OFFSET_ACC_C_Pos)         /* (POWER_OFFSET_CTRL) Active Power Offset for Accumulator Quantities Enable Mask */
#define POWER_OFFSET_CTRL_P_OFFSET_ACC_C(value)    (POWER_OFFSET_CTRL_P_OFFSET_ACC_C_Msk & (_UINT32_(value) << POWER_OFFSET_CTRL_P_OFFSET_ACC_C_Pos))
#define   POWER_OFFSET_CTRL_P_OFFSET_ACC_C_DISABLED_Val        _UINT32_(0x0)                   /* (POWER_OFFSET_CTRL) Active Power Offset disabled */
#define   POWER_OFFSET_CTRL_P_OFFSET_ACC_C_ENABLED_Val         _UINT32_(0x1)                   /* (POWER_OFFSET_CTRL) Active Power Offset enabled */
#define POWER_OFFSET_CTRL_S_OFFSET_PUL_Pos         _UINT32_(24)                                /* (POWER_OFFSET_CTRL) Apparent Power Offset for Pulse Quantities Enable Position */
#define POWER_OFFSET_CTRL_S_OFFSET_PUL_Msk         (_UINT32_(0x1) << POWER_OFFSET_CTRL_S_OFFSET_PUL_Pos)        /* (POWER_OFFSET_CTRL) Apparent Power Offset for Pulse Quantities Enable Mask */
#define POWER_OFFSET_CTRL_S_OFFSET_PUL(value)      (POWER_OFFSET_CTRL_S_OFFSET_PUL_Msk & (_UINT32_(value) << POWER_OFFSET_CTRL_S_OFFSET_PUL_Pos))
#define   POWER_OFFSET_CTRL_S_OFFSET_PUL_DISABLED_Val      _UINT32_(0x0)                            /* (POWER_OFFSET_CTRL) Apparent Power Offset for Pulse Quantities Enable disabled */
#define   POWER_OFFSET_CTRL_S_OFFSET_PUL_ENABLED_Val       _UINT32_(0x1)                            /* (POWER_OFFSET_CTRL) Apparent Power Offset for Pulse Quantities Enable enabled */
#define POWER_OFFSET_CTRL_Q_OFFSET_PUL_Pos         _UINT32_(27)                                /* (POWER_OFFSET_CTRL) Reactive Power Offset for Pulse Quantities Enable Position */
#define POWER_OFFSET_CTRL_Q_OFFSET_PUL_Msk         (_UINT32_(0x1) << POWER_OFFSET_CTRL_Q_OFFSET_PUL_Pos)        /* (POWER_OFFSET_CTRL) Reactive Power Offset for Pulse Quantities Enable Mask */
#define POWER_OFFSET_CTRL_Q_OFFSET_PUL(value)      (POWER_OFFSET_CTRL_Q_OFFSET_PUL_Msk & (_UINT32_(value) << POWER_OFFSET_CTRL_Q_OFFSET_PUL_Pos))
#define   POWER_OFFSET_CTRL_Q_OFFSET_PUL_DISABLED_Val      _UINT32_(0x0)                            /* (POWER_OFFSET_CTRL) Reactive Power Offset for Pulse Quantities Enable disabled */
#define   POWER_OFFSET_CTRL_Q_OFFSET_PUL_ENABLED_Val       _UINT32_(0x1)                            /* (POWER_OFFSET_CTRL) Reactive Power Offset for Pulse Quantities Enable enabled */
#define POWER_OFFSET_CTRL_P_OFFSET_PUL_Pos         _UINT32_(31)                                /* (POWER_OFFSET_CTRL) Active Power Offset for Pulse Quantities Enable Position */
#define POWER_OFFSET_CTRL_P_OFFSET_PUL_Msk         (_UINT32_(0x1) << POWER_OFFSET_CTRL_P_OFFSET_PUL_Pos)        /* (POWER_OFFSET_CTRL) Active Power Offset for Pulse Quantities Enable Mask */
#define POWER_OFFSET_CTRL_P_OFFSET_PUL(value)      (POWER_OFFSET_CTRL_P_OFFSET_PUL_Msk & (_UINT32_(value) << POWER_OFFSET_CTRL_P_OFFSET_PUL_Pos))
#define   POWER_OFFSET_CTRL_P_OFFSET_PUL_DISABLED_Val      _UINT32_(0x0)                            /* (POWER_OFFSET_CTRL) Active Power Offset for Pulse Quantities Enable disabled */
#define   POWER_OFFSET_CTRL_P_OFFSET_PUL_ENABLED_Val       _UINT32_(0x1)                            /* (POWER_OFFSET_CTRL) Active Power Offset for Pulse Quantities Enable enabled */

/* -------- POWER_OFFSET_P : (MET_CONTROL Offset: 0x48) (R/W  32) Active Power Offset (sQ1.30) -------- */
#define POWER_OFFSET_P_Pos                         _UINT32_(0)                                 /* (POWER_OFFSET_P) Active Power Offset Position */
#define POWER_OFFSET_P_Msk                         (_UINT32_(0xFFFFFFFF) << POWER_OFFSET_P_Pos)         /* (POWER_OFFSET_P) Active Power Offset Mask */
#define POWER_OFFSET_P_Val(value)                  (POWER_OFFSET_P_Msk & (_UINT32_(value) << POWER_OFFSET_P_Pos))

/* -------- POWER_OFFSET_Q : (MET_CONTROL Offset: 0x4C) (R/W  32) Active Power Offset (sQ1.30) -------- */
#define POWER_OFFSET_Q_Pos                         _UINT32_(0)                                 /* (POWER_OFFSET_Q) Active Power Offset Position */
#define POWER_OFFSET_Q_Msk                         (_UINT32_(0xFFFFFFFF) << POWER_OFFSET_Q_Pos)         /* (POWER_OFFSET_Q) Active Power Offset Mask */
#define POWER_OFFSET_Q_Val(value)                  (POWER_OFFSET_Q_Msk & (_UINT32_(value) << POWER_OFFSET_Q_Pos))

/* -------- POWER_OFFSET_S : (MET_CONTROL Offset: 0x50) (R/W  32) Apparent Power Offset (sQ1.30) -------- */
#define POWER_OFFSET_S_Pos                         _UINT32_(0)                                 /* (POWER_OFFSET_S) Apparent Power Offset Position */
#define POWER_OFFSET_S_Msk                         (_UINT32_(0xFFFFFFFF) << POWER_OFFSET_S_Pos)         /* (POWER_OFFSET_S) Apparent Power Offset Mask */
#define POWER_OFFSET_S_Val(value)                  (POWER_OFFSET_S_Msk & (_UINT32_(value) << POWER_OFFSET_S_Pos))

/* -------- SWELL_THRESHOLD_VA : (MET_CONTROL Offset: 0x54) (R/W  32) Voltage swell threshold for each half cycle of phase-A voltage (uQ0.32) -------- */
#define SWELL_THRESHOLD_VA_Pos                     _UINT32_(0)                                 /* (SWELL_THRESHOLD_VA) Voltage swell threshold Position */
#define SWELL_THRESHOLD_VA_Msk                     (_UINT32_(0xFFFFFFFF) << SWELL_THRESHOLD_VA_Pos)         /* (SWELL_THRESHOLD_VA) Voltage swell threshold Mask */
#define SWELL_THRESHOLD_VA_Val(value)              (SWELL_THRESHOLD_VA_Msk & (_UINT32_(value) << SWELL_THRESHOLD_VA_Pos))

/* -------- SWELL_THRESHOLD_VB : (MET_CONTROL Offset: 0x58) (R/W  32) Voltage swell threshold for each half cycle of phase-B voltage (uQ0.32) -------- */
#define SWELL_THRESHOLD_VB_Pos                     _UINT32_(0)                                 /* (SWELL_THRESHOLD_VB) Voltage swell threshold Position */
#define SWELL_THRESHOLD_VB_Msk                     (_UINT32_(0xFFFFFFFF) << SWELL_THRESHOLD_VB_Pos)         /* (SWELL_THRESHOLD_VB) Voltage swell threshold Mask */
#define SWELL_THRESHOLD_VB_Val(value)              (SWELL_THRESHOLD_VB_Msk & (_UINT32_(value) << SWELL_THRESHOLD_VB_Pos))

/* -------- SWELL_THRESHOLD_VC : (MET_CONTROL Offset: 0x5C) (R/W  32) Voltage swell threshold for each half cycle of phase-C voltage (uQ0.32) -------- */
#define SWELL_THRESHOLD_VC_Pos                     _UINT32_(0)                                 /* (SWELL_THRESHOLD_VC) Voltage swell threshold Position */
#define SWELL_THRESHOLD_VC_Msk                     (_UINT32_(0xFFFFFFFF) << SWELL_THRESHOLD_VC_Pos)         /* (SWELL_THRESHOLD_VC) Voltage swell threshold Mask */
#define SWELL_THRESHOLD_VC_Val(value)              (SWELL_THRESHOLD_VC_Msk & (_UINT32_(value) << SWELL_THRESHOLD_VC_Pos))

/* -------- SAG_THRESHOLD_VA : (MET_CONTROL Offset: 0x60) (R/W  32) Voltage sag threshold for each half cycle of phase-A voltage (uQ0.32) -------- */
#define SAG_THRESHOLD_VA_Pos                     _UINT32_(0)                                 /* (SAG_THRESHOLD_VA) Voltage sag threshold Position */
#define SAG_THRESHOLD_VA_Msk                     (_UINT32_(0xFFFFFFFF) << SAG_THRESHOLD_VA_Pos)         /* (SAG_THRESHOLD_VA) Voltage sag threshold Mask */
#define SAG_THRESHOLD_VA_Val(value)              (SAG_THRESHOLD_VA_Msk & (_UINT32_(value) << SAG_THRESHOLD_VA_Pos))

/* -------- SAG_THRESHOLD_VB : (MET_CONTROL Offset: 0x64) (R/W  32) Voltage sag threshold for each half cycle of phase-B voltage (uQ0.32) -------- */
#define SAG_THRESHOLD_VB_Pos                     _UINT32_(0)                                 /* (SAG_THRESHOLD_VB) Voltage sag threshold Position */
#define SAG_THRESHOLD_VB_Msk                     (_UINT32_(0xFFFFFFFF) << SAG_THRESHOLD_VB_Pos)         /* (SAG_THRESHOLD_VB) Voltage sag threshold Mask */
#define SAG_THRESHOLD_VB_Val(value)              (SAG_THRESHOLD_VB_Msk & (_UINT32_(value) << SAG_THRESHOLD_VB_Pos))

