phanidaa/MTSH/20251120a_MTSH_552_DLMS_FLEX0_DBG_FLEX3_Opti/20251120a_MTSH_552_DLMS_FLEX0_DBG_FLEX3_Opti/20251120a_MTSH_552_DLMS_FLEX0_DBG_FLEX3_Opti/apps/metering_demo/src/config/pic32cxmtc_db/driver/metrology/drv_metrology_regs.h
/* -------- SAG_THRESHOLD_VC : (MET_CONTROL Offset: 0x68) (R/W  32) Voltage sag threshold for each half cycle of phase-C voltage (uQ0.32) -------- */
#define SAG_THRESHOLD_VC_Pos                     _UINT32_(0)                                 /* (SAG_THRESHOLD_VC) Voltage sag threshold Position */
#define SAG_THRESHOLD_VC_Msk                     (_UINT32_(0xFFFFFFFF) << SAG_THRESHOLD_VC_Pos)         /* (SAG_THRESHOLD_VC) Voltage sag threshold Mask */
#define SAG_THRESHOLD_VC_Val(value)              (SAG_THRESHOLD_VC_Msk & (_UINT32_(value) << SAG_THRESHOLD_VC_Pos))

/* -------- K_IA : (MET_CONTROL Offset: 0x6C) (R/W  32) Current Conversion Factor (uQ22.10) -------- */
#define K_IA_Pos                                 _UINT32_(0)                                 /* (K_IA) Current Conversion Factor Position */
#define K_IA_Msk                                 (_UINT32_(0xFFFFFFFF) << K_IA_Pos)          /* (K_IA) Current Conversion Factor Mask */
#define K_IA_Val(value)                          (K_IA_Msk & (_UINT32_(value) << K_IA_Pos))

/* -------- K_VA : (MET_CONTROL Offset: 0x70) (R/W  32) Volatge Conversion Factor (uQ22.10) -------- */
#define K_VA_Pos                                 _UINT32_(0)                                 /* (K_VA) Volatge Conversion Factor Position */
#define K_VA_Msk                                 (_UINT32_(0xFFFFFFFF) << K_VA_Pos)          /* (K_VA) Volatge Conversion Factor Mask */
#define K_VA_Val(value)                          (K_VA_Msk & (_UINT32_(value) << K_VA_Pos))

/* -------- K_IB : (MET_CONTROL Offset: 0x74) (R/W  32) Current Conversion Factor (uQ22.10) -------- */
#define K_IB_Pos                                 _UINT32_(0)                                 /* (K_IB) Current Conversion Factor Position */
#define K_IB_Msk                                 (_UINT32_(0xFFFFFFFF) << K_IB_Pos)          /* (K_IB) Current Conversion Factor Mask */
#define K_IB_Val(value)                          (K_IB_Msk & (_UINT32_(value) << K_IB_Pos))

/* -------- K_VB : (MET_CONTROL Offset: 0x78) (R/W  32) Volatge Conversion Factor (uQ22.10) -------- */
#define K_VB_Pos                                 _UINT32_(0)                                 /* (K_VB) Volatge Conversion Factor Position */
#define K_VB_Msk                                 (_UINT32_(0xFFFFFFFF) << K_VB_Pos)          /* (K_VB) Volatge Conversion Factor Mask */
#define K_VB_Val(value)                          (K_VB_Msk & (_UINT32_(value) << K_VB_Pos))

/* -------- K_IC : (MET_CONTROL Offset: 0x7C) (R/W  32) Current Conversion Factor (uQ22.10) -------- */
#define K_IC_Pos                                 _UINT32_(0)                                 /* (K_IC) Current Conversion Factor Position */
#define K_IC_Msk                                 (_UINT32_(0xFFFFFFFF) << K_IC_Pos)          /* (K_IC) Current Conversion Factor Mask */
#define K_IC_Val(value)                          (K_IC_Msk & (_UINT32_(value) << K_IC_Pos))

/* -------- K_VC : (MET_CONTROL Offset: 0x80) (R/W  32) Volatge Conversion Factor (uQ22.10) -------- */
#define K_VC_Pos                                 _UINT32_(0)                                 /* (K_VC) Volatge Conversion Factor Position */
#define K_VC_Msk                                 (_UINT32_(0xFFFFFFFF) << K_VC_Pos)          /* (K_VC) Volatge Conversion Factor Mask */
#define K_VC_Val(value)                          (K_VC_Msk & (_UINT32_(value) << K_VC_Pos))

/* -------- K_IN : (MET_CONTROL Offset: 0x84) (R/W  32) Current Conversion Factor (uQ22.10) -------- */
#define K_IN_Pos                                 _UINT32_(0)                                 /* (K_IN) Current Conversion Factor Position */
#define K_IN_Msk                                 (_UINT32_(0xFFFFFFFF) << K_IN_Pos)          /* (K_IN) Current Conversion Factor Mask */
#define K_IN_Val(value)                          (K_IN_Msk & (_UINT32_(value) << K_IN_Pos))

/* -------- CAL_M_IA : (MET_CONTROL Offset: 0x88) (R/W  32) Current magnitude calibration constant, I_A (sQ2.29) -------- */
#define CAL_M_IA_Pos                             _UINT32_(0)                                 /* (CAL_M_IA) Current Conversion Factor Position */
#define CAL_M_IA_Msk                             (_UINT32_(0xFFFFFFFF) << CAL_M_IA_Pos)      /* (CAL_M_IA) Current Conversion Factor Mask */
#define CAL_M_IA_Val(value)                      (CAL_M_IA_Msk & (_UINT32_(value) << CAL_M_IA_Pos))

/* -------- CAL_M_VA : (MET_CONTROL Offset: 0x8C) (R/W  32) Voltage magnitude calibration constant, V_A (sQ2.29) -------- */
#define CAL_M_VA_Pos                             _UINT32_(0)                                 /* (CAL_M_VA) Voltage Conversion Factor Position */
#define CAL_M_VA_Msk                             (_UINT32_(0xFFFFFFFF) << CAL_M_VA_Pos)      /* (CAL_M_VA) Voltage Conversion Factor Mask */
#define CAL_M_VA_Val(value)                      (CAL_M_VA_Msk & (_UINT32_(value) << CAL_M_VA_Pos))

/* -------- CAL_M_IB : (MET_CONTROL Offset: 0x90) (R/W  32) Current magnitude calibration constant, I_B (sQ2.29) -------- */
#define CAL_M_IB_Pos                             _UINT32_(0)                                 /* (CAL_M_IB) Current Conversion Factor Position */
#define CAL_M_IB_Msk                             (_UINT32_(0xFFFFFFFF) << CAL_M_IB_Pos)      /* (CAL_M_IB) Current Conversion Factor Mask */
#define CAL_M_IB_Val(value)                      (CAL_M_IB_Msk & (_UINT32_(value) << CAL_M_IB_Pos))

/* -------- CAL_M_VB : (MET_CONTROL Offset: 0x94) (R/W  32) Voltage magnitude calibration constant, V_B (sQ2.29) -------- */
#define CAL_M_VB_Pos                             _UINT32_(0)                                 /* (CAL_M_VB) Voltage Conversion Factor Position */
#define CAL_M_VB_Msk                             (_UINT32_(0xFFFFFFFF) << CAL_M_VB_Pos)      /* (CAL_M_VB) Voltage Conversion Factor Mask */
#define CAL_M_VB_Val(value)                      (CAL_M_VB_Msk & (_UINT32_(value) << CAL_M_VB_Pos))

/* -------- CAL_M_IC : (MET_CONTROL Offset: 0x98) (R/W  32) Current magnitude calibration constant, I_C (sQ2.29) -------- */
#define CAL_M_IC_Pos                             _UINT32_(0)                                 /* (CAL_M_IC) Current Conversion Factor Position */
#define CAL_M_IC_Msk                             (_UINT32_(0xFFFFFFFF) << CAL_M_IC_Pos)      /* (CAL_M_IC) Current Conversion Factor Mask */
#define CAL_M_IC_Val(value)                      (CAL_M_IC_Msk & (_UINT32_(value) << CAL_M_IC_Pos))

/* -------- CAL_M_VC : (MET_CONTROL Offset: 0x9C) (R/W  32) Voltage magnitude calibration constant, V_C (sQ2.29) -------- */
#define CAL_M_VC_Pos                             _UINT32_(0)                                 /* (CAL_M_VC) Voltage Conversion Factor Position */
#define CAL_M_VC_Msk                             (_UINT32_(0xFFFFFFFF) << CAL_M_VC_Pos)      /* (CAL_M_VC) Voltage Conversion Factor Mask */
#define CAL_M_VC_Val(value)                      (CAL_M_VC_Msk & (_UINT32_(value) << CAL_M_VC_Pos))

