phanidaa/MTSH/20251120a_MTSH_552_DLMS_FLEX0_DBG_FLEX3_Opti/20251120a_MTSH_552_DLMS_FLEX0_DBG_FLEX3_Opti/20251120a_MTSH_552_DLMS_FLEX0_DBG_FLEX3_Opti/apps/metering_demo/src/config/pic32cxmtc_db/driver/metrology/drv_metrology_regs.h
/* -------- CAL_M_IN : (MET_CONTROL Offset: 0xA0) (R/W  32) Current magnitude calibration constant, I_N (sQ2.29) -------- */
#define CAL_M_IN_Pos                             _UINT32_(0)                                 /* (CAL_M_IN) Current Conversion Factor Position */
#define CAL_M_IN_Msk                             (_UINT32_(0xFFFFFFFF) << CAL_M_IN_Pos)      /* (CAL_M_IN) Current Conversion Factor Mask */
#define CAL_M_IN_Val(value)                      (CAL_M_IN_Msk & (_UINT32_(value) << CAL_M_IN_Pos))

/* -------- CAL_PH_IA : (MET_CONTROL Offset: 0xA4) (R/W  32) Current phase calibration constant, I_A (sQ2.29) -------- */
#define CAL_PH_IA_Pos                             _UINT32_(0)                                 /* (CAL_PH_IA) Current phase calibration constant Position */
#define CAL_PH_IA_Msk                             (_UINT32_(0xFFFFFFFF) << CAL_PH_IA_Pos)      /* (CAL_PH_IA) Current phase calibration constant Mask */
#define CAL_PH_IA_Val(value)                      (CAL_PH_IA_Msk & (_UINT32_(value) << CAL_PH_IA_Pos))

/* -------- CAL_PH_VA : (MET_CONTROL Offset: 0xA8) (R/W  32) Voltage phase calibration constant, V_A (sQ2.29) -------- */
#define CAL_PH_VA_Pos                             _UINT32_(0)                                 /* (CAL_PH_VA) Voltage phase calibration constant Position */
#define CAL_PH_VA_Msk                             (_UINT32_(0xFFFFFFFF) << CAL_PH_VA_Pos)      /* (CAL_PH_VA) Voltage phase calibration constant Mask */
#define CAL_PH_VA_Val(value)                      (CAL_PH_VA_Msk & (_UINT32_(value) << CAL_PH_VA_Pos))

/* -------- CAL_PH_IB : (MET_CONTROL Offset: 0xAC) (R/W  32) Current phase calibration constant, I_B (sQ2.29) -------- */
#define CAL_PH_IB_Pos                             _UINT32_(0)                                 /* (CAL_PH_IB) Current phase calibration constant Position */
#define CAL_PH_IB_Msk                             (_UINT32_(0xFFFFFFFF) << CAL_PH_IB_Pos)      /* (CAL_PH_IB) Current phase calibration constant Mask */
#define CAL_PH_IB_Val(value)                      (CAL_PH_IB_Msk & (_UINT32_(value) << CAL_PH_IB_Pos))

/* -------- CAL_PH_VB : (MET_CONTROL Offset: 0xB0) (R/W  32) Voltage phase calibration constant, V_B (sQ2.29) -------- */
#define CAL_PH_VB_Pos                             _UINT32_(0)                                 /* (CAL_PH_VB) Voltage phase calibration constant Position */
#define CAL_PH_VB_Msk                             (_UINT32_(0xFFFFFFFF) << CAL_PH_VB_Pos)      /* (CAL_PH_VB) Voltage phase calibration constant Mask */
#define CAL_PH_VB_Val(value)                      (CAL_PH_VB_Msk & (_UINT32_(value) << CAL_PH_VB_Pos))

/* -------- CAL_PH_IC : (MET_CONTROL Offset: 0xB4) (R/W  32) Current phase calibration constant, I_C (sQ2.29) -------- */
#define CAL_PH_IC_Pos                             _UINT32_(0)                                 /* (CAL_PH_IC) Current phase calibration constant Position */
#define CAL_PH_IC_Msk                             (_UINT32_(0xFFFFFFFF) << CAL_PH_IC_Pos)      /* (CAL_PH_IC) Current phase calibration constant Mask */
#define CAL_PH_IC_Val(value)                      (CAL_PH_IC_Msk & (_UINT32_(value) << CAL_PH_IC_Pos))

/* -------- CAL_PH_VC : (MET_CONTROL Offset: 0xB8) (R/W  32) Voltage phase calibration constant, V_C (sQ2.29) -------- */
#define CAL_PH_VC_Pos                             _UINT32_(0)                                 /* (CAL_PH_VC) Voltage phase calibration constant Position */
#define CAL_PH_VC_Msk                             (_UINT32_(0xFFFFFFFF) << CAL_PH_VC_Pos)      /* (CAL_PH_VC) Voltage phase calibration constant Mask */
#define CAL_PH_VC_Val(value)                      (CAL_PH_VC_Msk & (_UINT32_(value) << CAL_PH_VC_Pos))

/* -------- CAL_PH_IN : (MET_CONTROL Offset: 0xBC) (R/W  32) Current phase calibration constant, I_N (sQ2.29) -------- */
#define CAL_PH_IN_Pos                             _UINT32_(0)                                 /* (CAL_PH_IN) Current phase calibration constant Position */
#define CAL_PH_IN_Msk                             (_UINT32_(0xFFFFFFFF) << CAL_PH_IN_Pos)      /* (CAL_PH_IN) Current phase calibration constant Mask */
#define CAL_PH_IN_Val(value)                      (CAL_PH_IN_Msk & (_UINT32_(value) << CAL_PH_IN_Pos))

/* -------- CAPTURE_CTRL : (MET_CONTROL Offset: 0xC0) (R/W  32) Waveform capture control register -------- */
#define CAPTURE_CTRL_CAPTURE_TYPE_Pos             _UINT32_(0)                                 /* (CAPTURE_CTRL) Waveform capture control register Position */
#define CAPTURE_CTRL_CAPTURE_TYPE_Msk             (_UINT32_(0x3) << CAPTURE_CTRL_CAPTURE_TYPE_Pos)         /* (CAPTURE_CTRL) Waveform capture control register Mask */
#define CAPTURE_CTRL_CAPTURE_TYPE(value)          (CAPTURE_CTRL_CAPTURE_TYPE_Msk & (_UINT32_(value) << CAPTURE_CTRL_CAPTURE_TYPE_Pos))
#define   CAPTURE_CTRL_CAPTURE_TYPE_ONE_SHOT_Val    _UINT32_(0x0)                   /* (CAPTURE_CTRL) Capture will stop after capture finishes or is disabled */
#define   CAPTURE_CTRL_CAPTURE_TYPE_CONTINUOS_Val   _UINT32_(0x1)                   /* (CAPTURE_CTRL) Continuous capture of waveform data in circular-buffer fashion */
#define CAPTURE_CTRL_CAPTURE_SOURCE_Pos           _UINT32_(4)                                 /* (CAPTURE_CTRL) Capture Source Select Position */
#define CAPTURE_CTRL_CAPTURE_SOURCE_Msk           (_UINT32_(0x7) << CAPTURE_CTRL_CAPTURE_SOURCE_Pos)         /* (CAPTURE_CTRL) Capture Source Select Mask */
#define CAPTURE_CTRL_CAPTURE_SOURCE(value)        (CAPTURE_CTRL_CAPTURE_SOURCE_Msk & (_UINT32_(value) << CAPTURE_CTRL_CAPTURE_SOURCE_Pos))
#define   CAPTURE_CTRL_CAPTURE_SOURCE_16KHz_Val     _UINT32_(0x0)                   /* (CAPTURE_CTRL) Capture 16kHz data [sQ1.30] before DSP filtering */
#define   CAPTURE_CTRL_CAPTURE_SOURCE_4KHz_FBW_Val  _UINT32_(0x1)                   /* (CAPTURE_CTRL) Capture 4kHz FBW data [sQ2.29] (Full Bandwidth = fundamental + harmonics) */
#define   CAPTURE_CTRL_CAPTURE_SOURCE_4KHz_NBW_Val  _UINT32_(0x2)                   /* (CAPTURE_CTRL) Capture 4kHz NBW data [sQ2.29] (Narrow Bandwidth = fundamental only) */
#define CAPTURE_CTRL_CH_SEL_IA_Pos                _UINT32_(8)                                 /* (CAPTURE_CTRL) Capture Channel Select Position */
#define CAPTURE_CTRL_CH_SEL_IA_Msk                (_UINT32_(0x1) << CAPTURE_CTRL_CH_SEL_IA_Pos)         /* (CAPTURE_CTRL) Capture Channel Select Mask */
#define CAPTURE_CTRL_CH_SEL_IA(value)             (CAPTURE_CTRL_CH_SEL_IA_Msk & (_UINT32_(value) << CAPTURE_CTRL_CH_SEL_IA_Pos))
#define   CAPTURE_CTRL_CH_SEL_IA_DISABLED_Val       _UINT32_(0x0)                   /* (CAPTURE_CTRL) Waveform capture is disabled  */
#define   CAPTURE_CTRL_CH_SEL_IA_ENABLED_Val        _UINT32_(0x1)                   /* (CAPTURE_CTRL) Waveform capture is enabled */
#define CAPTURE_CTRL_CH_SEL_VA_Pos                _UINT32_(9)                                 /* (CAPTURE_CTRL) Capture Channel Select Position */
#define CAPTURE_CTRL_CH_SEL_VA_Msk                (_UINT32_(0x1) << CAPTURE_CTRL_CH_SEL_VA_Pos)         /* (CAPTURE_CTRL) Capture Channel Select Mask */
#define CAPTURE_CTRL_CH_SEL_VA(value)             (CAPTURE_CTRL_CH_SEL_VA_Msk & (_UINT32_(value) << CAPTURE_CTRL_CH_SEL_VA_Pos))
#define   CAPTURE_CTRL_CH_SEL_VA_DISABLED_Val       _UINT32_(0x0)                   /* (CAPTURE_CTRL) Waveform capture is disabled  */
#define   CAPTURE_CTRL_CH_SEL_VA_ENABLED_Val        _UINT32_(0x1)                   /* (CAPTURE_CTRL) Waveform capture is enabled */
#define CAPTURE_CTRL_CH_SEL_IB_Pos                _UINT32_(10)                                 /* (CAPTURE_CTRL) Capture Channel Select Position */
#define CAPTURE_CTRL_CH_SEL_IB_Msk                (_UINT32_(0x1) << CAPTURE_CTRL_CH_SEL_IB_Pos)         /* (CAPTURE_CTRL) Capture Channel Select Mask */
#define CAPTURE_CTRL_CH_SEL_IB(value)             (CAPTURE_CTRL_CH_SEL_IB_Msk & (_UINT32_(value) << CAPTURE_CTRL_CH_SEL_IB_Pos))
#define   CAPTURE_CTRL_CH_SEL_IB_DISABLED_Val       _UINT32_(0x0)                   /* (CAPTURE_CTRL) Waveform capture is disabled  */
#define   CAPTURE_CTRL_CH_SEL_IB_ENABLED_Val        _UINT32_(0x1)                   /* (CAPTURE_CTRL) Waveform capture is enabled */
#define CAPTURE_CTRL_CH_SEL_VB_Pos                _UINT32_(11)                                 /* (CAPTURE_CTRL) Capture Channel Select Position */
#define CAPTURE_CTRL_CH_SEL_VB_Msk                (_UINT32_(0x1) << CAPTURE_CTRL_CH_SEL_VB_Pos)         /* (CAPTURE_CTRL) Capture Channel Select Mask */
#define CAPTURE_CTRL_CH_SEL_VB(value)             (CAPTURE_CTRL_CH_SEL_VB_Msk & (_UINT32_(value) << CAPTURE_CTRL_CH_SEL_VB_Pos))
#define   CAPTURE_CTRL_CH_SEL_VB_DISABLED_Val       _UINT32_(0x0)                   /* (CAPTURE_CTRL) Waveform capture is disabled  */
#define   CAPTURE_CTRL_CH_SEL_VB_ENABLED_Val        _UINT32_(0x1)                   /* (CAPTURE_CTRL) Waveform capture is enabled */
#define CAPTURE_CTRL_CH_SEL_IC_Pos                _UINT32_(12)                                 /* (CAPTURE_CTRL) Capture Channel Select Position */
#define CAPTURE_CTRL_CH_SEL_IC_Msk                (_UINT32_(0x1) << CAPTURE_CTRL_CH_SEL_IC_Pos)         /* (CAPTURE_CTRL) Capture Channel Select Mask */
#define CAPTURE_CTRL_CH_SEL_IC(value)             (CAPTURE_CTRL_CH_SEL_IC_Msk & (_UINT32_(value) << CAPTURE_CTRL_CH_SEL_IC_Pos))
#define   CAPTURE_CTRL_CH_SEL_IC_DISABLED_Val       _UINT32_(0x0)                   /* (CAPTURE_CTRL) Waveform capture is disabled  */
#define   CAPTURE_CTRL_CH_SEL_IC_ENABLED_Val        _UINT32_(0x1)                   /* (CAPTURE_CTRL) Waveform capture is enabled */
#define CAPTURE_CTRL_CH_SEL_VC_Pos                _UINT32_(13)                                 /* (CAPTURE_CTRL) Capture Channel Select Position */
#define CAPTURE_CTRL_CH_SEL_VC_Msk                (_UINT32_(0x1) << CAPTURE_CTRL_CH_SEL_VC_Pos)         /* (CAPTURE_CTRL) Capture Channel Select Mask */
#define CAPTURE_CTRL_CH_SEL_VC(value)             (CAPTURE_CTRL_CH_SEL_VC_Msk & (_UINT32_(value) << CAPTURE_CTRL_CH_SEL_VC_Pos))
#define   CAPTURE_CTRL_CH_SEL_VC_DISABLED_Val       _UINT32_(0x0)                   /* (CAPTURE_CTRL) Waveform capture is disabled  */
#define   CAPTURE_CTRL_CH_SEL_VC_ENABLED_Val        _UINT32_(0x1)                   /* (CAPTURE_CTRL) Waveform capture is enabled */
#define CAPTURE_CTRL_CAPTURE_EN_Pos                _UINT32_(31)                                 /* (CAPTURE_CTRL) Enable waveform capture Position */
#define CAPTURE_CTRL_CAPTURE_EN_Msk                (_UINT32_(0x1) << CAPTURE_CTRL_CAPTURE_EN_Pos)         /* (CAPTURE_CTRL) Enable waveform capture Mask */
#define CAPTURE_CTRL_CAPTURE_EN(value)             (CAPTURE_CTRL_CAPTURE_EN_Msk & (_UINT32_(value) << CAPTURE_CTRL_CAPTURE_EN_Pos))
#define   CAPTURE_CTRL_CAPTURE_EN_DISABLED_Val       _UINT32_(0x0)                   /* (CAPTURE_CTRL) Waveform capture feature is disabled  */
#define   CAPTURE_CTRL_CAPTURE_EN_ENABLED_Val        _UINT32_(0x1)                   /* (CAPTURE_CTRL) Waveform capture feature is enabled */

/* -------- CAPTURE_BUFF_SIZE : (MET_CONTROL Offset: 0xC4) (R/W  32) Waveform capture buffer size in units of 32-bits -------- */
#define CAPTURE_BUFF_SIZE_Pos                      _UINT32_(0)                                 /* (CAPTURE_BUFF_SIZE) Waveform capture buffer size Position */
#define CAPTURE_BUFF_SIZE_Msk                      (_UINT32_(0xFFFFFF) << CAPTURE_BUFF_SIZE_Pos)      /* (CAPTURE_BUFF_SIZE) Waveform capture buffer size Mask */
#define CAPTURE_BUFF_SIZE_Val(value)               (CAPTURE_BUFF_SIZE_Msk & (_UINT32_(value) << CAPTURE_BUFF_SIZE_Pos))

/* -------- CAPTURE_ADDR : (MET_CONTROL Offset: 0xC8) (R/W  32) Waveform capture buffer address pointer -------- */
#define CAPTURE_ADDR_Pos                           _UINT32_(0)                                 /* (CAPTURE_ADDR) Waveform capture buffer address pointer Position */
#define CAPTURE_ADDR_Msk                           (_UINT32_(0xFFFFFFFF) << CAPTURE_ADDR_Pos)      /* (CAPTURE_ADDR) Waveform capture buffer address pointer Mask */
#define CAPTURE_ADDR_Val(value)                    (CAPTURE_ADDR_Msk & (_UINT32_(value) << CAPTURE_ADDR_Pos))

/* -------- ATSENSE_CTRL_20_23 : (MET_CONTROL Offset: 0xD8) (R/W  32) ATSense control: channels I0,I1,V1,I2 -------- */
#define ATSENSE_CTRL_20_23_I0_ON_Pos                _UINT32_(0)                                 /* (ATSENSE_CTRL_20_23) Enable channel I0 Position */
#define ATSENSE_CTRL_20_23_I0_ON_Msk                (_UINT32_(0x1) << ATSENSE_CTRL_20_23_I0_ON_Pos)         /* (ATSENSE_CTRL_20_23) Enable channel I0 Mask */
#define ATSENSE_CTRL_20_23_I0_ON(value)             (ATSENSE_CTRL_20_23_I0_ON_Msk & (_UINT32_(value) << ATSENSE_CTRL_20_23_I0_ON_Pos))
#define   ATSENSE_CTRL_20_23_I0_ON_DISABLED_Val       _UINT32_(0x0)                   /* (ATSENSE_CTRL_20_23) Channel is disabled  */
#define   ATSENSE_CTRL_20_23_I0_ON_ENABLED_Val        _UINT32_(0x1)                   /* (ATSENSE_CTRL_20_23) Channel is enabled */
#define ATSENSE_CTRL_20_23_TEMPMEAS_Pos             _UINT32_(1)                                 /* (ATSENSE_CTRL_20_23) Channel I0/Temperature multiplex select bit Position */
#define ATSENSE_CTRL_20_23_TEMPMEAS_Msk             (_UINT32_(0x1) << ATSENSE_CTRL_20_23_TEMPMEAS_Pos)         /* (ATSENSE_CTRL_20_23) Channel I0/Temperature multiplex select bit Mask */
#define ATSENSE_CTRL_20_23_TEMPMEAS(value)          (ATSENSE_CTRL_20_23_TEMPMEAS_Msk & (_UINT32_(value) << ATSENSE_CTRL_20_23_TEMPMEAS_Pos))
#define   ATSENSE_CTRL_20_23_TEMPMEAS_CURRENT_I0_Val  _UINT32_(0x0)                   /* (ATSENSE_CTRL_20_23) Measurement of external current I0  */
#define   ATSENSE_CTRL_20_23_TEMPMEAS_TEMP_Val        _UINT32_(0x1)                   /* (ATSENSE_CTRL_20_23) Measurement of internal temperature sensor */
#define ATSENSE_CTRL_20_23_I0_GAIN_Pos              _UINT32_(4)                                 /* (ATSENSE_CTRL_20_23) Channel I0 gain Position */
#define ATSENSE_CTRL_20_23_I0_GAIN_Msk              (_UINT32_(0x3) << ATSENSE_CTRL_20_23_I0_GAIN_Pos)         /* (ATSENSE_CTRL_20_23) Channel I0 gain Mask */
#define ATSENSE_CTRL_20_23_I0_GAIN(value)           (ATSENSE_CTRL_20_23_I0_GAIN_Msk & (_UINT32_(value) << ATSENSE_CTRL_20_23_I0_GAIN_Pos))
#define   ATSENSE_CTRL_20_23_I0_GAIN_1_Val            _UINT32_(0x0)                   /* (ATSENSE_CTRL_20_23) Channel has a gain of 1  */
#define   ATSENSE_CTRL_20_23_I0_GAIN_2_Val            _UINT32_(0x1)                   /* (ATSENSE_CTRL_20_23) Channel has a gain of 2 */
#define   ATSENSE_CTRL_20_23_I0_GAIN_4_Val            _UINT32_(0x2)                   /* (ATSENSE_CTRL_20_23) Channel has a gain of 4 */
#define   ATSENSE_CTRL_20_23_I0_GAIN_8_Val            _UINT32_(0x3)                   /* (ATSENSE_CTRL_20_23) Channel has a gain of 8 */
#define ATSENSE_CTRL_20_23_I1_ON_Pos                _UINT32_(8)                                 /* (ATSENSE_CTRL_20_23) Enable channel I1 Position */
#define ATSENSE_CTRL_20_23_I1_ON_Msk                (_UINT32_(0x1) << ATSENSE_CTRL_20_23_I1_ON_Pos)         /* (ATSENSE_CTRL_20_23) Enable channel I1 Mask */
#define ATSENSE_CTRL_20_23_I1_ON(value)             (ATSENSE_CTRL_20_23_I1_ON_Msk & (_UINT32_(value) << ATSENSE_CTRL_20_23_I1_ON_Pos))
#define   ATSENSE_CTRL_20_23_I1_ON_DISABLED_Val       _UINT32_(0x0)                   /* (ATSENSE_CTRL_20_23) Channel is disabled  */
#define   ATSENSE_CTRL_20_23_I1_ON_ENABLED_Val        _UINT32_(0x1)                   /* (ATSENSE_CTRL_20_23) Channel is enabled */
#define ATSENSE_CTRL_20_23_I1_GAIN_Pos              _UINT32_(12)                                /* (ATSENSE_CTRL_20_23) Channel I1 gain Position */
#define ATSENSE_CTRL_20_23_I1_GAIN_Msk              (_UINT32_(0x3) << ATSENSE_CTRL_20_23_I1_GAIN_Pos)         /* (ATSENSE_CTRL_20_23) Channel I1 gain Mask */
#define ATSENSE_CTRL_20_23_I1_GAIN(value)           (ATSENSE_CTRL_20_23_I1_GAIN_Msk & (_UINT32_(value) << ATSENSE_CTRL_20_23_I1_GAIN_Pos))
#define   ATSENSE_CTRL_20_23_I1_GAIN_1_Val            _UINT32_(0x0)                   /* (ATSENSE_CTRL_20_23) Channel has a gain of 1  */
#define   ATSENSE_CTRL_20_23_I1_GAIN_2_Val            _UINT32_(0x1)                   /* (ATSENSE_CTRL_20_23) Channel has a gain of 2 */
#define   ATSENSE_CTRL_20_23_I1_GAIN_4_Val            _UINT32_(0x2)                   /* (ATSENSE_CTRL_20_23) Channel has a gain of 4 */
#define   ATSENSE_CTRL_20_23_I1_GAIN_8_Val            _UINT32_(0x3)                   /* (ATSENSE_CTRL_20_23) Channel has a gain of 8 */
#define ATSENSE_CTRL_20_23_V1_ON_Pos                _UINT32_(16)                                 /* (ATSENSE_CTRL_20_23) Enable channel V1 Position */
#define ATSENSE_CTRL_20_23_V1_ON_Msk                (_UINT32_(0x1) << ATSENSE_CTRL_20_23_V1_ON_Pos)         /* (ATSENSE_CTRL_20_23) Enable channel V1 Mask */
#define ATSENSE_CTRL_20_23_V1_ON(value)             (ATSENSE_CTRL_20_23_V1_ON_Msk & (_UINT32_(value) << ATSENSE_CTRL_20_23_V1_ON_Pos))
#define   ATSENSE_CTRL_20_23_V1_ON_DISABLED_Val       _UINT32_(0x0)                   /* (ATSENSE_CTRL_20_23) Channel is disabled  */
#define   ATSENSE_CTRL_20_23_V1_ON_ENABLED_Val        _UINT32_(0x1)                   /* (ATSENSE_CTRL_20_23) Channel is enabled */
#define ATSENSE_CTRL_20_23_I2_ON_Pos                _UINT32_(24)                                 /* (ATSENSE_CTRL_20_23) Enable channel I2 Position */
#define ATSENSE_CTRL_20_23_I2_ON_Msk                (_UINT32_(0x1) << ATSENSE_CTRL_20_23_I2_ON_Pos)         /* (ATSENSE_CTRL_20_23) Enable channel I2 Mask */
#define ATSENSE_CTRL_20_23_I2_ON(value)             (ATSENSE_CTRL_20_23_I2_ON_Msk & (_UINT32_(value) << ATSENSE_CTRL_20_23_I2_ON_Pos))
#define   ATSENSE_CTRL_20_23_I2_ON_DISABLED_Val       _UINT32_(0x0)                   /* (ATSENSE_CTRL_20_23) Channel is disabled  */
#define   ATSENSE_CTRL_20_23_I2_ON_ENABLED_Val        _UINT32_(0x1)                   /* (ATSENSE_CTRL_20_23) Channel is enabled */
#define ATSENSE_CTRL_20_23_I2_GAIN_Pos              _UINT32_(28)                                /* (ATSENSE_CTRL_20_23) Channel I2 gain Position */
#define ATSENSE_CTRL_20_23_I2_GAIN_Msk              (_UINT32_(0x3) << ATSENSE_CTRL_20_23_I2_GAIN_Pos)         /* (ATSENSE_CTRL_20_23) Channel I2 gain Mask */
#define ATSENSE_CTRL_20_23_I2_GAIN(value)           (ATSENSE_CTRL_20_23_I2_GAIN_Msk & (_UINT32_(value) << ATSENSE_CTRL_20_23_I2_GAIN_Pos))
#define   ATSENSE_CTRL_20_23_I2_GAIN_1_Val            _UINT32_(0x0)                   /* (ATSENSE_CTRL_20_23) Channel has a gain of 1  */
#define   ATSENSE_CTRL_20_23_I2_GAIN_2_Val            _UINT32_(0x1)                   /* (ATSENSE_CTRL_20_23) Channel has a gain of 2 */
#define   ATSENSE_CTRL_20_23_I2_GAIN_4_Val            _UINT32_(0x2)                   /* (ATSENSE_CTRL_20_23) Channel has a gain of 4 */
#define   ATSENSE_CTRL_20_23_I2_GAIN_8_Val            _UINT32_(0x3)                   /* (ATSENSE_CTRL_20_23) Channel has a gain of 8 */

