phanidaa/MTSH/20251120a_MTSH_552_DLMS_FLEX0_DBG_FLEX3_Opti/20251120a_MTSH_552_DLMS_FLEX0_DBG_FLEX3_Opti/20251120a_MTSH_552_DLMS_FLEX0_DBG_FLEX3_Opti/apps/metering_demo/src/config/pic32cxmtc_db/driver/metrology/drv_metrology_regs.h
/* -------- ATSENSE_CTRL_24_27 : (MET_CONTROL Offset: 0xDC) (R/W  32) ATSense control: channels V2,I3,V3,ANA -------- */
#define ATSENSE_CTRL_24_27_V2_ON_Pos                _UINT32_(0)                                 /* (ATSENSE_CTRL_24_27) Enable channel V2 Position */
#define ATSENSE_CTRL_24_27_V2_ON_Msk                (_UINT32_(0x1) << ATSENSE_CTRL_24_27_V2_ON_Pos)         /* (ATSENSE_CTRL_24_27) Enable channel V2 Mask */
#define ATSENSE_CTRL_24_27_V2_ON(value)             (ATSENSE_CTRL_24_27_V2_ON_Msk & (_UINT32_(value) << ATSENSE_CTRL_24_27_V2_ON_Pos))
#define   ATSENSE_CTRL_24_27_V2_ON_DISABLED_Val       _UINT32_(0x0)                   /* (ATSENSE_CTRL_24_27) Channel is disabled  */
#define   ATSENSE_CTRL_24_27_V2_ON_ENABLED_Val        _UINT32_(0x1)                   /* (ATSENSE_CTRL_24_27) Channel is enabled */
#define ATSENSE_CTRL_24_27_I3_ON_Pos                _UINT32_(8)                                 /* (ATSENSE_CTRL_24_27) Enable channel I3 Position */
#define ATSENSE_CTRL_24_27_I3_ON_Msk                (_UINT32_(0x1) << ATSENSE_CTRL_24_27_I3_ON_Pos)         /* (ATSENSE_CTRL_24_27) Enable channel I3 Mask */
#define ATSENSE_CTRL_24_27_I3_ON(value)             (ATSENSE_CTRL_24_27_I3_ON_Msk & (_UINT32_(value) << ATSENSE_CTRL_24_27_I3_ON_Pos))
#define   ATSENSE_CTRL_24_27_I3_ON_DISABLED_Val       _UINT32_(0x0)                   /* (ATSENSE_CTRL_24_27) Channel is disabled  */
#define   ATSENSE_CTRL_24_27_I3_ON_ENABLED_Val        _UINT32_(0x1)                   /* (ATSENSE_CTRL_24_27) Channel is enabled */
#define ATSENSE_CTRL_24_27_I3_GAIN_Pos              _UINT32_(12)                                /* (ATSENSE_CTRL_24_27) Channel I3 gain Position */
#define ATSENSE_CTRL_24_27_I3_GAIN_Msk              (_UINT32_(0x3) << ATSENSE_CTRL_24_27_I3_GAIN_Pos)         /* (ATSENSE_CTRL_24_27) Channel I3 gain Mask */
#define ATSENSE_CTRL_24_27_I3_GAIN(value)           (ATSENSE_CTRL_24_27_I3_GAIN_Msk & (_UINT32_(value) << ATSENSE_CTRL_24_27_I3_GAIN_Pos))
#define   ATSENSE_CTRL_24_27_I3_GAIN_1_Val            _UINT32_(0x0)                   /* (ATSENSE_CTRL_24_27) Channel has a gain of 1  */
#define   ATSENSE_CTRL_24_27_I3_GAIN_2_Val            _UINT32_(0x1)                   /* (ATSENSE_CTRL_24_27) Channel has a gain of 2 */
#define   ATSENSE_CTRL_24_27_I3_GAIN_4_Val            _UINT32_(0x2)                   /* (ATSENSE_CTRL_24_27) Channel has a gain of 4 */
#define   ATSENSE_CTRL_24_27_I3_GAIN_8_Val            _UINT32_(0x3)                   /* (ATSENSE_CTRL_24_27) Channel has a gain of 8 */
#define ATSENSE_CTRL_24_27_V3_ON_Pos                _UINT32_(16)                                 /* (ATSENSE_CTRL_24_27) Enable channel V3 Position */
#define ATSENSE_CTRL_24_27_V3_ON_Msk                (_UINT32_(0x1) << ATSENSE_CTRL_24_27_V3_ON_Pos)         /* (ATSENSE_CTRL_24_27) Enable channel V3 Mask */
#define ATSENSE_CTRL_24_27_V3_ON(value)             (ATSENSE_CTRL_24_27_V3_ON_Msk & (_UINT32_(value) << ATSENSE_CTRL_24_27_V3_ON_Pos))
#define   ATSENSE_CTRL_24_27_V3_ON_DISABLED_Val       _UINT32_(0x0)                   /* (ATSENSE_CTRL_24_27) Channel is disabled  */
#define   ATSENSE_CTRL_24_27_V3_ON_ENABLED_Val        _UINT32_(0x1)                   /* (ATSENSE_CTRL_24_27) Channel is enabled */
#define ATSENSE_CTRL_24_27_ONBIAS_Pos                _UINT32_(24)                                 /* (ATSENSE_CTRL_24_27) Enable bias Position */
#define ATSENSE_CTRL_24_27_ONBIAS_Msk                (_UINT32_(0x1) << ATSENSE_CTRL_24_27_ONBIAS_Pos)         /* (ATSENSE_CTRL_24_27) Enable bias Mask */
#define ATSENSE_CTRL_24_27_ONBIAS(value)             (ATSENSE_CTRL_24_27_ONBIAS_Msk & (_UINT32_(value) << ATSENSE_CTRL_24_27_ONBIAS_Pos))
#define   ATSENSE_CTRL_24_27_ONBIAS_DISABLED_Val       _UINT32_(0x0)                   /* (ATSENSE_CTRL_24_27) Bias is disabled  */
#define   ATSENSE_CTRL_24_27_ONBIAS_ENABLED_Val        _UINT32_(0x1)                   /* (ATSENSE_CTRL_24_27) Bias is enabled */
#define ATSENSE_CTRL_24_27_ONREF_Pos                _UINT32_(25)                                 /* (ATSENSE_CTRL_24_27) Enable internal reference Position */
#define ATSENSE_CTRL_24_27_ONREF_Msk                (_UINT32_(0x1) << ATSENSE_CTRL_24_27_ONREF_Pos)         /* (ATSENSE_CTRL_24_27) Enable internal reference Mask */
#define ATSENSE_CTRL_24_27_ONREF(value)             (ATSENSE_CTRL_24_27_ONREF_Msk & (_UINT32_(value) << ATSENSE_CTRL_24_27_ONREF_Pos))
#define   ATSENSE_CTRL_24_27_ONREF_DISABLED_Val       _UINT32_(0x0)                   /* (ATSENSE_CTRL_24_27) Internal reference is disabled  */
#define   ATSENSE_CTRL_24_27_ONREF_ENABLED_Val        _UINT32_(0x1)                   /* (ATSENSE_CTRL_24_27) Internal reference is enabled */
#define ATSENSE_CTRL_24_27_ONLDO_Pos                _UINT32_(26)                                 /* (ATSENSE_CTRL_24_27) Enable internal LDO Position */
#define ATSENSE_CTRL_24_27_ONLDO_Msk                (_UINT32_(0x1) << ATSENSE_CTRL_24_27_ONLDO_Pos)         /* (ATSENSE_CTRL_24_27) Enable internal LDO Mask */
#define ATSENSE_CTRL_24_27_ONLDO(value)             (ATSENSE_CTRL_24_27_ONLDO_Msk & (_UINT32_(value) << ATSENSE_CTRL_24_27_ONLDO_Pos))
#define   ATSENSE_CTRL_24_27_ONLDO_DISABLED_Val       _UINT32_(0x0)                   /* (ATSENSE_CTRL_24_27) Internal LDO is disabled  */
#define   ATSENSE_CTRL_24_27_ONLDO_ENABLED_Val        _UINT32_(0x1)                   /* (ATSENSE_CTRL_24_27) Internal LDO is enabled */

/* -------- ATSENSE_CTRL_28_2B : (MET_CONTROL Offset: 0xE0) (R/W  32) ATSense control: Registers: x28, x2A-2B, x2D -------- */
#define ATSENSE_CTRL_28_2B_OSR_Pos                  _UINT32_(0)                                 /* (ATSENSE_CTRL_28_2B) Over Sampling Ratio Position */
#define ATSENSE_CTRL_28_2B_OSR_Msk                  (_UINT32_(0x3) << ATSENSE_CTRL_28_2B_OSR_Pos)         /* (ATSENSE_CTRL_28_2B) Over Sampling Ratio Mask */
#define ATSENSE_CTRL_28_2B_OSR(value)               (ATSENSE_CTRL_28_2B_OSR_Msk & (_UINT32_(value) << ATSENSE_CTRL_28_2B_OSR_Pos))
#define   ATSENSE_CTRL_28_2B_OSR8_Val                 _UINT32_(0x0)                   /* (ATSENSE_CTRL_28_2B) System OSR = 8  */
#define   ATSENSE_CTRL_24_27_OSR16_Val                _UINT32_(0x1)                   /* (ATSENSE_CTRL_28_2B) System OSR = 16 */
#define   ATSENSE_CTRL_24_27_OSR32_Val                _UINT32_(0x2)                   /* (ATSENSE_CTRL_28_2B) System OSR = 32 */
#define   ATSENSE_CTRL_24_27_OSR64_Val                _UINT32_(0x3)                   /* (ATSENSE_CTRL_28_2B) System OSR = 64 */
#define ATSENSE_CTRL_28_2B_MSB_MODE_Pos             _UINT32_(4)                                 /* (ATSENSE_CTRL_28_2B) Mode Selection Position */
#define ATSENSE_CTRL_28_2B_MSB_MODE_Msk             (_UINT32_(0x1) << ATSENSE_CTRL_28_2B_MSB_MODE_Pos)         /* (ATSENSE_CTRL_28_2B) Mode Selection Mask */
#define ATSENSE_CTRL_28_2B_MSB_MODE(value)          (ATSENSE_CTRL_28_2B_MSB_MODE_Msk & (_UINT32_(value) << ATSENSE_CTRL_28_2B_MSB_MODE_Pos))
#define   ATSENSE_CTRL_28_2B_MSB_MODE_32BITS_Val      _UINT32_(0x0)                   /* (ATSENSE_CTRL_28_2B) 32-bits mode  */
#define   ATSENSE_CTRL_28_2B_MSB_MODE_16BITS_Val      _UINT32_(0x1)                   /* (ATSENSE_CTRL_28_2B) 16-bits mode */

/* -------- POWER_OFFSET_P_A : (MET_CONTROL Offset: 0xE8) (R/W  32) Phase-A active power offset (sQ9.40) -------- */
#define POWER_OFFSET_P_A_Pos                        _UINT32_(0)                                 /* (POWER_OFFSET_P_A) Phase-A active power offset Position */
#define POWER_OFFSET_P_A_Msk                        (_UINT32_(0xFFFFFFFF) << POWER_OFFSET_P_A_Pos)      /* (POWER_OFFSET_P_A) Phase-A active power offset Mask */
#define POWER_OFFSET_P_A_Val(value)                 (POWER_OFFSET_P_A_Msk & (_UINT32_(value) << POWER_OFFSET_P_A_Pos))

/* -------- POWER_OFFSET_P_B : (MET_CONTROL Offset: 0xEC) (R/W  32) Phase-B active power offset (sQ9.40) -------- */
#define POWER_OFFSET_P_B_Pos                        _UINT32_(0)                                 /* (POWER_OFFSET_P_B) Phase-B active power offset Position */
#define POWER_OFFSET_P_B_Msk                        (_UINT32_(0xFFFFFFFF) << POWER_OFFSET_P_B_Pos)      /* (POWER_OFFSET_P_B) Phase-B active power offset Mask */
#define POWER_OFFSET_P_B_Val(value)                 (POWER_OFFSET_P_B_Msk & (_UINT32_(value) << POWER_OFFSET_P_B_Pos))

/* -------- POWER_OFFSET_P_C : (MET_CONTROL Offset: 0xF0) (R/W  32) Phase-C active power offset (sQ9.40) -------- */
#define POWER_OFFSET_P_C_Pos                        _UINT32_(0)                                 /* (POWER_OFFSET_P_C) Phase-C active power offset Position */
#define POWER_OFFSET_P_C_Msk                        (_UINT32_(0xFFFFFFFF) << POWER_OFFSET_P_C_Pos)      /* (POWER_OFFSET_P_C) Phase-C active power offset Mask */
#define POWER_OFFSET_P_C_Val(value)                 (POWER_OFFSET_P_C_Msk & (_UINT32_(value) << POWER_OFFSET_P_C_Pos))

/* -------- POWER_OFFSET_Q_A : (MET_CONTROL Offset: 0xF4) (R/W  32) Phase-A reactive power offset (sQ9.40) -------- */
#define POWER_OFFSET_Q_A_Pos                        _UINT32_(0)                                 /* (POWER_OFFSET_Q_A) Phase-A reactive power offset Position */
#define POWER_OFFSET_Q_A_Msk                        (_UINT32_(0xFFFFFFFF) << POWER_OFFSET_Q_A_Pos)      /* (POWER_OFFSET_Q_A) Phase-A reactive power offset Mask */
#define POWER_OFFSET_Q_A_Val(value)                 (POWER_OFFSET_Q_A_Msk & (_UINT32_(value) << POWER_OFFSET_Q_A_Pos))

