phanidaa/MTSH/20251120a_MTSH_552_DLMS_FLEX0_DBG_FLEX3_Opti/20251120a_MTSH_552_DLMS_FLEX0_DBG_FLEX3_Opti/20251120a_MTSH_552_DLMS_FLEX0_DBG_FLEX3_Opti/apps/metering_demo/src/config/pic32cxmtc_db/driver/metrology/drv_metrology_regs.h
/* -------- INTERVAL_NUM : (MET_STATUS Offset: 0x10) (R/W  32) Measurement Interval Number -------- */
#define INTERVAL_NUM_HALFCYCLE_COUNT_Pos                   _UINT32_(0)                       /* (INTERVAL_NUM) Subinterval number Position */
#define INTERVAL_NUM_HALFCYCLE_COUNT_Msk                   (_UINT32_(0xFFFF) << INTERVAL_NUM_HALFCYCLE_COUNT_Pos)      /* (INTERVAL_NUM) Subinterval number Mask */
#define INTERVAL_NUM_HALFCYCLE_COUNT(value)                (INTERVAL_NUM_HALFCYCLE_COUNT_Msk & (_UINT32_(value) << INTERVAL_NUM_HALFCYCLE_COUNT_Pos))
#define INTERVAL_NUM_INTERVAL_NUM_Pos                      _UINT32_(16)                       /* (INTERVAL_NUM) Interval number Position */
#define INTERVAL_NUM_INTERVAL_NUM_Msk                      (_UINT32_(0xFFFF) << INTERVAL_NUM_INTERVAL_NUM_Pos)      /* (INTERVAL_NUM) Interval number Mask */
#define INTERVAL_NUM_INTERVAL_NUM(value)                   (INTERVAL_NUM_INTERVAL_NUM_Msk & (_UINT32_(value) << INTERVAL_NUM_INTERVAL_NUM_Pos))

/* -------- N : (MET_STATUS Offset: 0x14) (R/W  32) Number of Samples in the Last Measurement Interval (uQ16.0) -------- */
#define N_Pos                            _UINT32_(0)                       /* (N) Number of Samples in the Last Measurement Interval Position */
#define N_Msk                            (_UINT32_(0xFFFF) << N_Pos)      /* (N) Number of Samples in the Last Measurement Interval Mask */
#define N_Val(value)                     (N_Msk & (_UINT32_(value) << N_Pos))

/* -------- PH_OFFSET : (MET_STATUS Offset: 0x18) (R/W  32) Phase Correction Filter Offset (sQ0.31) -------- */
#define PH_OFFSET_Pos                    _UINT32_(0)                       /* (PH_OFFSET) Phase Correction Filter Offset Position */
#define PH_OFFSET_Msk                    (_UINT32_(0xFFFFFFFF) << N_Pos)      /* (PH_OFFSET) Phase Correction Filter Offset Mask */
#define PH_OFFSET_Val(value)             (PH_OFFSET_Msk & (_UINT32_(value) << PH_OFFSET_Pos))

/* -------- FREQ : (MET_STATUS Offset: 0x1C) (R/W  32) Active Line Voltage Fundamental Harmonic Frequency (uQ20.12) -------- */
#define FREQ_Pos                         _UINT32_(0)                       /* (FREQ) Active Line Voltage Fundamental Harmonic Frequency Position */
#define FREQ_Msk                         (_UINT32_(0xFFFFFFFF) << N_Pos)      /* (FREQ) Active Line Voltage Fundamental Harmonic Frequency Mask */
#define FREQ_Val(value)                  (FREQ_Msk & (_UINT32_(value) << FREQ_Pos))

/* -------- FREQ_VA : (MET_STATUS Offset: 0x20) (R/W  32) Frequency of fundamental harmonic, VA (uQ20.12) -------- */
#define FREQ_VA_Pos                      _UINT32_(0)                       /* (FREQ_VA) Frequency of fundamental harmonic, VA Position */
#define FREQ_VA_Msk                      (_UINT32_(0xFFFFFFFF) << N_Pos)      /* (FREQ_VA) Frequency of fundamental harmonic, VA Mask */
#define FREQ_VA_Val(value)               (FREQ_VA_Msk & (_UINT32_(value) << FREQ_VA_Pos))

/* -------- FREQ_VB : (MET_STATUS Offset: 0x24) (R/W  32) Frequency of fundamental harmonic, VB (uQ20.12) -------- */
#define FREQ_VB_Pos                      _UINT32_(0)                       /* (FREQ_VB) Frequency of fundamental harmonic, VB Position */
#define FREQ_VB_Msk                      (_UINT32_(0xFFFFFFFF) << N_Pos)      /* (FREQ_VB) Frequency of fundamental harmonic, VB Mask */
#define FREQ_VB_Val(value)               (FREQ_VB_Msk & (_UINT32_(value) << FREQ_VB_Pos))

/* -------- FREQ_VC : (MET_STATUS Offset: 0x28) (R/W  32) Frequency of fundamental harmonic, VC (uQ20.12) -------- */
#define FREQ_VC_Pos                      _UINT32_(0)                       /* (FREQ_VC) Frequency of fundamental harmonic, VC Position */
#define FREQ_VC_Msk                      (_UINT32_(0xFFFFFFFF) << N_Pos)      /* (FREQ_VC) Frequency of fundamental harmonic, VC Mask */
#define FREQ_VC_Val(value)               (FREQ_VC_Msk & (_UINT32_(value) << FREQ_VC_Pos))

/* -------- TEMPERATURE : (MET_STATUS Offset: 0x30) (R/W  32) Sensor Temperature (sQ23.8) -------- */
#define TEMPERATURE_Pos                  _UINT32_(0)                       /* (TEMPERATURE) Sensor Temperature Position */
#define TEMPERATURE_Msk                  (_UINT32_(0xFFFFFFFF) << N_Pos)      /* (TEMPERATURE) Sensor Temperature Mask */
#define TEMPERATURE_Val(value)           (TEMPERATURE_Msk & (_UINT32_(value) << TEMPERATURE_Pos))

/* -------- I_A_MAX : (MET_STATUS Offset: 0x34) (R/W  32) Phase A Current Peak (sQ2.29) -------- */
#define I_A_MAX_Pos                      _UINT32_(0)                       /* (I_A_MAX) Phase A Current Peak Position */
#define I_A_MAX_Msk                      (_UINT32_(0xFFFFFFFF) << N_Pos)      /* (I_A_MAX) Phase A Current Peak Mask */
#define I_A_MAX_Val(value)               (I_A_MAX_Msk & (_UINT32_(value) << I_A_MAX_Pos))

/* -------- I_B_MAX : (MET_STATUS Offset: 0x38) (R/W  32) Phase B Current Peak (sQ2.29) -------- */
#define I_B_MAX_Pos                      _UINT32_(0)                       /* (I_B_MAX) Phase B Current Peak Position */
#define I_B_MAX_Msk                      (_UINT32_(0xFFFFFFFF) << N_Pos)      /* (I_B_MAX) Phase B Current Peak Mask */
#define I_B_MAX_Val(value)               (I_B_MAX_Msk & (_UINT32_(value) << I_B_MAX_Pos))

/* -------- I_C_MAX : (MET_STATUS Offset: 0x3C) (R/W  32) Phase C Current Peak (sQ2.29) -------- */
#define I_C_MAX_Pos                      _UINT32_(0)                       /* (I_C_MAX) Phase C Current Peak Position */
#define I_C_MAX_Msk                      (_UINT32_(0xFFFFFFFF) << N_Pos)      /* (I_C_MAX) Phase C Current Peak Mask */
#define I_C_MAX_Val(value)               (I_C_MAX_Msk & (_UINT32_(value) << I_C_MAX_Pos))

/* -------- I_Ni_MAX : (MET_STATUS Offset: 0x40) (R/W  32) Neutral Current Peak (sQ16.15) -------- */
#define I_Ni_MAX_Pos                     _UINT32_(0)                       /* (I_Ni_MAX) Neutral Current Peak Position */
#define I_Ni_MAX_Msk                     (_UINT32_(0xFFFFFFFF) << N_Pos)      /* (I_Ni_MAX) Neutral Current Peak Mask */
#define I_Ni_MAX_Val(value)              (I_Ni_MAX_Msk & (_UINT32_(value) << I_Ni_MAX_Pos))

/* -------- I_Nm_MAX : (MET_STATUS Offset: 0x44) (R/W  32) Neutral Current Peak (sQ16.15) -------- */
#define I_Nm_MAX_Pos                     _UINT32_(0)                       /* (I_Nm_MAX) Neutral Current Peak Position */
#define I_Nm_MAX_Msk                     (_UINT32_(0xFFFFFFFF) << N_Pos)      /* (I_Nm_MAX) Neutral Current Peak Mask */
#define I_Nm_MAX_Val(value)              (I_Nm_MAX_Msk & (_UINT32_(value) << I_Nm_MAX_Pos))

